sforganization/NoMaster/STM32F103_1025_Yingshi/HARDWARE/COMMENT/SysComment.c
									}
								}
							}

							break;

						case TOUCH_SUB_AGAIN:
							if ((PS_Sta) && (SysTask.nWaitTime == 0)) //如果有指纹按下
							{
								ensure				= PS_GetImage();

								if (ensure == 0x00)
								{
									ensure				= PS_GenChar(CharBuffer2); //生成特征

									if (ensure == 0x00)
									{
										ensure				= PS_Match(); //对比两次指纹

										if (ensure == 0x00) //成功
										{

											ensure				= PS_RegModel(); //生成指纹模板

											if (ensure == 0x00)
											{

												ensure				= PS_StoreChar(CharBuffer2, SysTask.u16FingerID); //储存模板

												if (ensure == 0x00)
												{
													SysTask.TouchSub	= TOUCH_SUB_WAIT;
													SysTask.nWaitTime	= 3000; //延时一定时间退出

													//													  SysTask.bEnFingerTouch = FALSE;	 //成功，则禁止指纹模块任务
													//成功，发送到平板端，应答
													g_FingerAck 		= ACK_SUCCESS;
													g_AckType			= FINGER_ACK_TYPE;

													if (SysTask.SendState == SEND_IDLE)
														SysTask.SendState = SEND_TABLET_FINGER;
												}
												else 
												{
													//匹配失败，发送到平板端，应答
													SysTask.TouchSub	= TOUCH_SUB_ENTER;
													SysTask.nWaitTime	= 3000; //延时一定时间退出
												}
											}
											else 
											{
												//失败，发送到平板端，应答
												g_FingerAck 		= ACK_FAILED;
												g_AckType			= FINGER_ACK_TYPE;

												if (SysTask.SendState == SEND_IDLE)
													SysTask.SendState = SEND_TABLET_FINGER;

												SysTask.TouchSub	= TOUCH_SUB_ENTER;
												SysTask.nWaitTime	= 3000; //延时一定时间退出
											}
										}
										else 
										{
											//失败，发送到平板端，应答
											g_FingerAck 		= ACK_FAILED;
											g_AckType			= FINGER_ACK_TYPE;

											if (SysTask.SendState == SEND_IDLE)
												SysTask.SendState = SEND_TABLET_FINGER;

											SysTask.TouchSub	= TOUCH_SUB_ENTER;
											SysTask.nWaitTime	= 3000; //延时一定时间退出
										}
									}
								}
							}

							break;

						case TOUCH_SUB_WAIT: // *
							if ((SysTask.nWaitTime == 0))
							{
								SysTask.TouchState	= TOUCH_IDLE;
								SysTask.bEnFingerTouch = FALSE; //成功，则禁止指纹模块任务
								SysTask.TouchSub	= TOUCH_SUB_INIT;

							}

							break;

						default:
							break;
					}
				}
				break;

			case TOUCH_DEL_USER:
				{
					switch (SysTask.TouchSub)
					{
						case TOUCH_SUB_INIT: // *
							if (SysTask.nWaitTime == 0)
							{
								u8MatchCnt			= 0;
								SysTask.TouchSub	= TOUCH_SUB_ENTER;
							}

							break;

						case TOUCH_SUB_ENTER: //
							if (SysTask.nWaitTime)
							{
								break;
							}

							ensure = PS_DeletChar(SysTask.u16FingerID, 1);

							if (ensure == 0)
							{
								//发送到平板端面
								g_FingerAck 		= ACK_SUCCESS;
								g_AckType			= FINGER_ACK_TYPE;

								if (SysTask.SendState == SEND_IDLE)
									SysTask.SendState = SEND_TABLET_FINGER;

								SysTask.TouchSub	= TOUCH_SUB_WAIT;
								SysTask.nWaitTime	= 100; //延时一定时间退出
							}
							else //删除失败 ,
							{
								u8MatchCnt++;
								SysTask.nWaitTime	= 500; //延时一定时间再次删除

								if (u8MatchCnt >= 3) //失败退出
								{
									//发送到平板端面
									g_FingerAck 		= ACK_FAILED;
									g_AckType			= FINGER_ACK_TYPE;

									if (SysTask.SendState == SEND_IDLE)
										SysTask.SendState = SEND_TABLET_FINGER;

									SysTask.TouchSub	= TOUCH_SUB_WAIT;
								}
							}

							break;

						case TOUCH_SUB_WAIT: // *
							if ((SysTask.nWaitTime == 0))
							{
								SysTask.TouchState	= TOUCH_IDLE;
								SysTask.bEnFingerTouch = FALSE; //成功，则禁止指纹模块任务
								SysTask.TouchSub	= TOUCH_SUB_INIT;
							}

							break;

						default:
							break;
					}
				}
				break;

			case TOUCH_IDLE:
			default:
				break;
		}
	}
}


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void LedTask(void)
{
	if (SysTask.LED_Mode != SysTask.LED_ModeSave)
	{
		if (SysTask.LED_Mode == LED_MODE_ON)
			GPIO_ResetBits(LED_GPIO, LED_PIN);
		else 
			GPIO_SetBits(LED_GPIO, LED_PIN);

		SysTask.LED_ModeSave = SysTask.LED_Mode;
	}
}


/*******************************************************************************
* 名称: 
* 功能: 校验和
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
u8 CheckSum(u8 * pu8Addr, u8 u8Count)
{
	u8 i				= 0;
	u8 u8Result 		= 0;

	for (i = 0; i < u8Count; i++)
	{
		u8Result			+= pu8Addr[i];
	}

	return ~ u8Result;
}


/*******************************************************************************
* 名称: 
* 功能: 从机包发送
*		包头 + 从机地址 + 	 手表地址 + 命令 + 数据包[3] + 校验和 + 包尾
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void SlavePackageSend(u8 u8SlaveAddr, u8 u8GlassAddr, u8 u8Cmd, u8 * u8Par)
{
	u8 i				= 0;
	u8 u8SendArr[9] 	=
	{
		0
	};

	u8SendArr[0]		= 0xAA; 					//包头
	u8SendArr[1]		= u8SlaveAddr;				//从机地址
	u8SendArr[2]		= u8GlassAddr;				//手表地址
	u8SendArr[3]		= u8Cmd;					//命令
	u8SendArr[4]		= u8Par[0]; 				//参数1
	u8SendArr[5]		= u8Par[1]; 				//参数2
	u8SendArr[6]		= u8Par[2]; 				//参数3

	u8SendArr[7]		= CheckSum(u8SendArr, 7);	//校验和
	u8SendArr[8]		= 0x55; 					//包尾


	for (i = 0; i < 8; i++)
	{
		USART_SendData(USART3, u8SendArr[i]);
	}
}


#define RECV_PAKAGE_CHECK		10	 //   10个数据检验

/*
static int Usart3JudgeStr(void)
{
   //	  包头 + 命令 +参数[3]		+数据[3]	  +  校验和 + 包尾
   //	  包头：0XAA
   //	  命令： CMD_UPDATE	 、 CMD_READY 
   //	  参数： 地址，LED模式，增加删除指纹ID,
   //	  数据：（锁开关 + 方向 + 时间）
   //	  校验和：
   //	  包尾： 0X55

   //主机发给平板的包分为两种。。一种是单个，另一种是全部表数据

   const char *data;

   u8 u8Cmd;
   u8 i;
   u8 str[8] = {0}; 
   str[0]=0xAA;

   u8 u8CheckSum = 0;

   data=strstr((const char*)USART3_RX_BUF,(const char*)str);
   if(!data)
	   return -1;
	
   if( *(data + 9) != 0X55) //包尾
	   return -1;
	   
   for(i = 0; i < RECV_PAKAGE_CHECK; i++)
	   u8CheckSum += *(data + i);
   
   if(u8CheckSum != 0x55)	//检验和不等于包尾 返回失败
	   return -1;

   
   u8Cmd = *(data + 1);

   switch(u8Cmd)

   {
	   case CMD_READY:
		   SysTask.bTabReady	= TRUE;
		   break;
		   
	   case CMD_UPDATE:
		   if(*(data + 2) ==  0xFF)   //该全部手表
		   {
			   for(i = 0 ; i < GLASS_MAX_CNT; i++)
			   {
				   SysTask.WatchState[i].u8LockState  = *(data + 5);
				   SysTask.WatchState[i].u8Dir	   = *(data + 6);
				   SysTask.WatchState[i].MotoTime	   = *(data + 7);

				   SysTask.Moto_Mode[i]		=  (MotoFR)*(data + 6);
				   SysTask.Moto_Time[i]		=  (MotoTime_e)*(data + 7);
				   SysTask.Moto_RunTime[i]	=  g_au16MoteTime[SysTask.Moto_Time[i]][1];
				   SysTask.Moto_WaitTime[i]	=  g_au16MoteTime[SysTask.Moto_Time[i]][2];
				   //SysTask.LockMode[i]		  =  *(data + 5);  //锁状态不在此更新，因为开锁需要密?
   ??之后
					   
