sforganization/NoMaster/STM32F103_1025_Yingshi/HARDWARE/COMMENT/SysComment.c
			   }
		   }
		   else  //单个手表的状态更新
		   {
			   SysTask.WatchState[*(data + 2)].u8LockState	= *(data + 5);
			   SysTask.WatchState[*(data + 2)].u8Dir		 = *(data + 6);
			   SysTask.WatchState[*(data + 2)].MotoTime	 = *(data + 7);
			   SysTask.Moto_Mode[*(data + 2)]		  =  (MotoFR)*(data + 6);
			   SysTask.Moto_Time[*(data + 2)]		  =  (MotoTime_e)*(data + 7);
			   SysTask.Moto_RunTime[*(data + 2)]	  =  g_au16MoteTime[SysTask.Moto_Time[i]][1];
			   SysTask.Moto_WaitTime[*(data + 2)]	  =  g_au16MoteTime[SysTask.Moto_Time[i]][2];
			  // SysTask.LockMode[*(data + 2)]		=  *(data + 5);//锁状态不在此更新，因为开锁需要
   密码之后
		   }	  

		   
		   SysTask.u16SaveTick = SAVE_TICK_TIME;	//数据更新保存
		   break;
		   
	   case CMD_ADD_USER:
		   if(*(data + 2) <= FINGER_MAX_CNT)
		   {
			   SysTask.bEnFingerTouch	= TRUE;
			   SysTask.TouchState		= TOUCH_ADD_USER;
			   SysTask.u16FingerID	= *(data + 2);
		   }
		   break;
			   
	   case CMD_DEL_USER:
		   if(*(data + 2) <= FINGER_MAX_CNT)
		   {
			   SysTask.bEnFingerTouch	= TRUE;
			   SysTask.TouchState		= TOUCH_DEL_USER;
			   SysTask.u16FingerID	= *(data + 2);
		   }
		   break;
		   
	   case CMD_OPEN_LOCK:
		   if(*(data + 2) ==  0xFF)   //全部锁状态
		   {
			   for(i = 0 ; i < GLASS_MAX_CNT; i++)
			   {
				   SysTask.LockMode[i] = LOCK_ON; 
			   }
		   }
		   else  //单个锁状态更新
		   {
			  SysTask.LockMode[*(data + 2)] = LOCK_ON;	//电机转起来锁状态就是OFF?
		   } 
		   break;
		   
	   case CMD_RUN_MOTO:	 
		   if(*(data + 2) ==  0xFF)   //该全部手表
		   {
			   for(i = 0 ; i < GLASS_MAX_CNT; i++)
			   {
				   SysTask.LockMode[i]	= LOCK_OFF;  //电机转起来锁状态就是OFF?
				   SysTask.Moto_State[i]	= MOTO_STATE_INIT;
			   }
		   }
		   else  //单个手表的状态更新
		   {
			   SysTask.LockMode[*(data + 2)]	  = LOCK_OFF;  //电机转起来锁状态就是OFF?
			   SysTask.Moto_State[*(data + 2)]	  = MOTO_STATE_INIT;
		   } 
		   break;
		   
	   case CMD_LED_MODE:	 
		   if((*(data + 2) ==	LED_MODE_ON) || (*(data + 2) ==  LED_MODE_OFF))   //LED模式有效
		   {
			 SysTask.LED_Mode = *(data + 2);
		   } 
		   
		   SysTask.u16SaveTick = SAVE_TICK_TIME;	//数据更新保存
		   break;
		   
	   default:
		   //发送到平板端，应答	 命令错误
		   g_FingerAck = ACK_ERROR;
		   if(SysTask.SendState == SEND_IDLE)
			   SysTask.SendState = SEND_TABLET_FINGER;
		   break;
   }
			   
   return 0;	//			
}
*/

/*******************************************************************************
* 名称: ，接收包处理。。。平板发给主机的命令包处理
* 功能: 判断中断接收的数组有没有更新数据包 或者就绪包
* 形参:		
* 返回: -1, 失败 0:成功
* 说明: 
*******************************************************************************/
static int Usart1JudgeStr(void)
{
	//	  包头 + 命令 +参数[3]		+数据[3]	  +  校验和 + 包尾
	//	  包头：0XAA
	//	  命令： CMD_UPDATE	 、 CMD_READY 
	//	  参数： 地址，LED模式，增加删除指纹ID,
	//	  数据：（锁开关 + 方向 + 时间）
	//	  校验和：
	//	  包尾： 0X55
	//主机发给平板的包分为两种。。一种是单个，另一种是全部表数据
	const char * data;

	u8 u8Cmd;
	u8 i;
  int tmp = 0;
	u8 str[8]			=
	{
		0
	};
	u8 u8CheckSum		= 0;
	str[0]				= 0xAA;


	data				= strstr((const char *) USART1_RX_BUF, (const char *) str);

	if (!data)
		return - 1;

	if (* (data + 9) != 0X55) //包尾
		return - 1;

	for (i = 0; i < RECV_PAKAGE_CHECK; i++)
		u8CheckSum += * (data + i);

	if (u8CheckSum != 0x55 - 1) //检验和不等于包尾 返回失败
		return - 1;


	u8Cmd				= * (data + 1);

	switch (u8Cmd)
	{
		case CMD_READY:
			SysTask.bTabReady = TRUE;
			SysTask.SendState = SEND_INIT;
			break;

		case CMD_UPDATE:
			if (* (data + 2) == 0xFF) //该全部手表
			{
				for (i = 0; i < GLASS_MAX_CNT; i++)
				{
					//SysTask.WatchState[i].u8LockState  = *(data + 5);  ////锁状态不在此更新，因为开锁需要密码之后
					SysTask.WatchState[i].u8Dir = * (data + 6);
					SysTask.WatchState[i].MotoTime = * (data + 7);

					SysTask.Moto_Mode[i] = (MotoFR) * (data + 6);
					SysTask.Moto_Time[i] = (MotoTime_e) * (data + 7);
					SysTask.Moto_RunTime[i] = g_au16MoteTime[SysTask.Moto_Time[i]][1];
					SysTask.Moto_WaitTime[i] = g_au16MoteTime[SysTask.Moto_Time[i]][2];

				}
			}
			else //单个手表的状态更新
			{
				//				  SysTask.WatchState[*(data + 2)].u8LockState  = *(data + 5);//锁状态不在此更新，因为开锁需要密码之后
				SysTask.WatchState[* (data + 2)].u8Dir = * (data + 6);
				SysTask.WatchState[* (data + 2)].MotoTime = * (data + 7);
				SysTask.Moto_Mode[* (data + 2)] = (MotoFR) * (data + 6);
				SysTask.Moto_Time[* (data + 2)] = (MotoTime_e) * (data + 7);
				
        tmp = SysTask.Moto_Time[* (data + 2)];
				SysTask.Moto_RunTime[* (data + 2)] = g_au16MoteTime[tmp][1];
				SysTask.Moto_WaitTime[* (data + 2)] = g_au16MoteTime[tmp][2];
			}

			SysTask.u16SaveTick = SAVE_TICK_TIME; //数据更新保存
			break;

		case CMD_ADD_USER:
			if (* (data + 2) <= FINGER_MAX_CNT)
			{
				SysTask.bEnFingerTouch = TRUE;
				SysTask.TouchState	= TOUCH_ADD_USER;
				SysTask.TouchSub	= TOUCH_SUB_INIT; //如果从删除指纹到增加指纹
				SysTask.u16FingerID = * (data + 2);
			}

			break;

		case CMD_DEL_USER:
			if (* (data + 2) <= FINGER_MAX_CNT)
			{
				SysTask.bEnFingerTouch = TRUE;
				SysTask.TouchState	= TOUCH_DEL_USER;
				SysTask.TouchSub	= TOUCH_SUB_INIT; //如果从删除指纹到增加指纹
				SysTask.u16FingerID = * (data + 2);
			}

			break;

		case CMD_LOCK_MODE: //
			if (* (data + 2) == 0xFF) //全部锁状态
			{
				for (i = 0; i < GLASS_MAX_CNT; i++)
				{
					SysTask.LockMode[i] = * (data + 5);
				}
			}
			else //单个锁状态更新
			{
				SysTask.LockMode[* (data + 2)] = * (data + 5); //电机转起来锁状态就是OFF?
			}

			break;

		//	 
		//			case CMD_RUN_MOTO:
		//				if (* (data + 2) == 0xFF) //该全部手表
		//				{
		//					for (i = 0; i < GLASS_MAX_CNT; i++)
		//					{
		//						SysTask.LockMode[i] = LOCK_OFF; //电机转起来锁状态就是OFF?
		//						SysTask.Moto_State[i] = MOTO_STATE_INIT;
		//					}
		//				}
		//				else //单个手表的状态更新
		//				{
		//					SysTask.LockMode[* (data + 2)] = LOCK_OFF; //电机转起来锁状态就是OFF?
		//					SysTask.Moto_State[* (data + 2)] = MOTO_STATE_INIT;
		//				}
		//	 
		//				break;
		//	 
		case CMD_LED_MODE:
			if ((* (data + 2) == LED_MODE_ON) || (* (data + 2) == LED_MODE_OFF)) //LED模式有效
			{
				SysTask.LED_Mode	= * (data + 2);
			}

			SysTask.u16SaveTick = SAVE_TICK_TIME; //数据更新保存
			break;

		case CMD_PASSWD_ON: // 密码模式，开启指纹
			SysTask.bEnFingerTouch = TRUE;
			SysTask.TouchState = TOUCH_MATCH_INIT;
			break;

		case CMD_PASSWD_OFF: // 密码模式，关闭指纹
			SysTask.bEnFingerTouch = FALSE;
			SysTask.TouchState = TOUCH_IDLE;
			break;

		default:
			//发送到平板端，应答	 命令错误
			g_FingerAck = ACK_ERROR;
			g_AckType = ERROR_ACK_TYPE;

			if (SysTask.SendState == SEND_IDLE)
				SysTask.SendState = SEND_TABLET_FINGER;

			break;
	}

	return 0; //		   
}


