sforganization/NoMaster/STM32F103_1025_Yingshi/HARDWARE/COMMENT/SysComment.c
/*******************************************************************************
* 名称: 
* 功能: 平板给主机发送的命令包处理
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void TabletToHostTask(void)
{
	if (USART1_RX_STA & 0X8000) //接收到平板数据
	{
		Usart1JudgeStr();
		USART1_RX_STA		= 0;					//清空状态
	}

	//	  if(USART3_RX_STA & 0X8000)//接收到平板数据
	//	  {
	//		  Usart3JudgeStr();
	//		  USART3_RX_STA   =   0; //清空状态
	//	  }
}


/*******************************************************************************
* 名称: 
* 功能: 主机发送全部状态给平板  零点
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void SendToTablet_Zero(u8 u8GlassAddr)
{
	//	  包头 + 地址 + 命令 + 数据包[48] + 校验和 + 包尾
	//	  包头：0XAA
	//	  手表地址：0X8~：最高位为1表示全部						~:表示有几个手表
	//				0x01：第一个手表
	//	  命令：
	//	  数据：（锁开关 + 方向 + 时间）* 16 = 48
	//	  校验和：
	//	  包尾： 0X55
	u8 i;
	u8 u8aSendArr[53]	=
	{
		0
	};
	SendArrayUnion_u SendArrayUnion;

	u8aSendArr[1]		= MCU_ACK_ADDR; 			//应答地址

	u8aSendArr[2]		= ZERO_ACK_TYPE;			//应答类型零点
	u8aSendArr[3]		= u8GlassAddr;				//手表地址

	u8aSendArr[0]		= 0xAA;

	for (i = 0; i < 48; i++)
	{
		u8aSendArr[3 + i]	= SendArrayUnion.u8SendArray[i];
	}

	u8aSendArr[51]		= CheckSum(u8aSendArr, 51); //校验和
	u8aSendArr[52]		= 0x55; 					//包尾s 

	for (i = 0; i < 53; i++)
	{
		Usart1_SendByte(u8aSendArr[i]);
	}
}


/*******************************************************************************
* 名称: 
* 功能: 主机发送全部状态给平板
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void SendToTablet(u8 u8GlassAddr)
{
	//	  包头 + 地址 + 命令 + 数据包[48] + 校验和 + 包尾
	//	  包头：0XAA
	//	  手表地址：0X8~：最高位为1表示全部						~:表示有几个手表
	//				0x01：第一个手表
	//	  命令：
	//	  数据：（锁开关 + 方向 + 时间）* 16 = 48
	//	  校验和：
	//	  包尾： 0X55
	u8 i;
	u8 u8aSendArr[53]	=
	{
		0
	};
	SendArrayUnion_u SendArrayUnion;

	if (u8GlassAddr == MCU_ACK_ADDR) //应答地址
	{
		u8aSendArr[2]		= g_AckType;			//应答类型
		u8aSendArr[3]		= g_FingerAck;			//命令数据	应答错误类型
	}
	else 
	{
		memcpy(SendArrayUnion.WatchState, SysTask.WatchState, sizeof(SysTask.WatchState));

		u8aSendArr[2]		= 0x11; 				//命令数据保留用 

		for (i = 0; i < 48; i++)
		{
			u8aSendArr[3 + i]	= SendArrayUnion.u8SendArray[i];
		}
	}

	u8aSendArr[0]		= 0xAA;
	u8aSendArr[1]		= u8GlassAddr;
	u8aSendArr[51]		= CheckSum(u8aSendArr, 51); //校验和
	u8aSendArr[52]		= 0x55; 					//包尾s 

	for (i = 0; i < 53; i++)
	{
		Usart1_SendByte(u8aSendArr[i]);
	}
}


/*******************************************************************************
* 名称: 
* 功能: 发送给平板的任务
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void SendTabletTask(void)
{
	switch (SysTask.SendState)
	{
		case SEND_INIT:
			if (SysTask.bTabReady == TRUE)
			{
				//SLAVE_SEND_ALL; 
				//				  g_GlassSendAddr = GLASS_SEND_ALL | GLASS_MAX_CNT;
				SendToTablet(GLASS_SEND_ALL | GLASS_MAX_CNT); //代表手表个数
				SysTask.SendState	= SEND_IDLE;
			}

			break;

		case SEND_TABLET_FINGER: //发送模块应答给平板
			SendToTablet(MCU_ACK_ADDR); //
			SysTask.SendState = SEND_IDLE;
			break;

		case SEND_TABLET_ZERO: //发送模块零点给平板,错过了就不发了，平板端有超时机制
			SendToTablet_Zero(g_GlassSendAddr); //	这样的话只能发送最后一个的了，如果存在总线冲突，按照人的手速来再次点击可以在200ms以上，所以道理上来说冲突的机率还是很小的
			SysTask.SendState = SEND_IDLE;
			break;

		/* 现在阶段没有使用这部分的内容，因为不做应答检验，所以下面这部分暂时用不?
			?
		case SEND_TABLET_SINGLE://发送单个从机状态给平板
			SendToTablet(g_SlaveSendAddr, g_GlassSendAddr);
			break;
		*/
		case SEND_IDLE:
		default:
			SysTask.SendState = SEND_IDLE;
			break;
	}
}


/*******************************************************************************
* 名称: 
* 功能: 主机接发送给从机发送的命令包处理
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void HostToTabletTask(void)
{
	//	  static u8 i = 0;
	//	  static u8 j = 0;
	//	  static u8 state = 0;
	//SysTask.WatchStateSave, SysTask.SlaveState
	//	  switch(state)
	//		  {
	//		  case HtoS_CHECK:
	//			  if(	  (SysTask.WatchStateSave.MotoTime != SysTask.WatchState.MotoTime)
	//				 ||   (SysTask.WatchStateSave.MotoTime != SysTask.WatchState.MotoTime)
	//				 ||   (SysTask.WatchStateSave.MotoTime != SysTask.WatchState.MotoTime))
	//			  {
	//				  state = HtoS_SEND;
	//			  }
	//			  else
	//			  {
	//				  if(i == 7){
	//					  j++;
	//					  if(j == 4) j = 0;
	//					  i = 0;
	//				   }
	//				  else
	//					  i++;
	//			  }
	//			  break;
	//		  case HtoS_SEND:
	//			  SysTask.WatchState.MotoTime = SysTask.WatchStateSave.MotoTime;
	//			  SysTask.WatchState.MotoTime = SysTask.WatchStateSave.MotoTime;
	//			  SysTask.WatchState.MotoTime = SysTask.WatchStateSave.MotoTime;
	//			  state = HtoS_WAIT;
	//			  break;
	//		  case HtoS_WAIT:
	//			  if(SysTask.u16HtoSWaitTime == 0)
	//				  state = HtoS_CHECK;
	//			  break;
	//		  default:
	//			  break;
	//	  }
}


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void Moto_01_Task(void)
{
	static u8 u8State	= 0;

	//A电机
	switch (SysTask.Moto_State[GLASS_01])
	{
		case MOTO_STATE_INIT:
			if (SysTask.Moto_StateTime[GLASS_01] == 0)
			{
				SysTask.Moto_RunTime[GLASS_01] = g_au16MoteTime[SysTask.Moto_Time[GLASS_01]][1];
				SysTask.Moto_State[GLASS_01] = MOTO_STATE_CHANGE_DIR;
				SysTask.Moto_SubState[GLASS_01] = MOTO_SUB_STATE_RUN;
			}

			break;

		case MOTO_STATE_CHANGE_TIME:
			break;

		case MOTO_STATE_CHANGE_DIR:
			if (SysTask.Moto_Mode[GLASS_01] == MOTO_FR_FWD)
			{
				GPIO_SetBits(MOTO_P_GPIO, MOTO_01_PIN_P); //正转
				GPIO_ResetBits(MOTO_N_GPIO, MOTO_01_PIN_N); //
				SysTask.Moto_State[GLASS_01] = MOTO_STATE_RUN_NOR;
			}
			else if (SysTask.Moto_Mode[GLASS_01] == MOTO_FR_REV)
			{
				GPIO_SetBits(MOTO_N_GPIO, MOTO_01_PIN_N); //反转
				GPIO_ResetBits(MOTO_P_GPIO, MOTO_01_PIN_P); //
				SysTask.Moto_State[GLASS_01] = MOTO_STATE_RUN_NOR;
			}
			else if (SysTask.Moto_Mode[GLASS_01] == MOTO_FR_FWD_REV)
			{ //正反转
				u8State 			= 0;
				GPIO_SetBits(MOTO_P_GPIO, MOTO_01_PIN_P); //先正转
				GPIO_ResetBits(MOTO_N_GPIO, MOTO_01_PIN_N); //
				SysTask.Moto_State[GLASS_01] = MOTO_STATE_RUN_CHA;
			}

			SysTask.Moto_ModeSave[GLASS_01] = SysTask.Moto_Mode[GLASS_01];
			break;

		case MOTO_STATE_RUN_NOR: //普通运行状态
			if (SysTask.Moto_Mode[GLASS_01] != SysTask.Moto_ModeSave[GLASS_01])
			{
				GPIO_ResetBits(MOTO_P_GPIO, MOTO_01_PIN_P); //先暂停电机转动
				GPIO_ResetBits(MOTO_N_GPIO, MOTO_01_PIN_N); //先暂停电机转动
				SysTask.Moto_State[GLASS_01] = MOTO_STATE_INIT; //先延时一段时间再翻转
				SysTask.Moto_StateTime[GLASS_01] = 200;
				break;
			}

			switch (SysTask.Moto_SubState[GLASS_01])
			{
				case MOTO_SUB_STATE_RUN:
					if (SysTask.Moto_RunTime[GLASS_01] == 0)
					{
						SysTask.Moto_WaitTime[GLASS_01] = g_au16MoteTime[SysTask.Moto_Time[GLASS_01]][2];
						SysTask.Moto_SubState[GLASS_01] = MOTO_SUB_STATE_WAIT;
						GPIO_ResetBits(MOTO_P_GPIO, MOTO_01_PIN_P); //停止
						GPIO_ResetBits(MOTO_N_GPIO, MOTO_01_PIN_N); //
					}

					break;

				case MOTO_SUB_STATE_WAIT:
					if (SysTask.Moto_WaitTime[GLASS_01] == 0)
					{
						SysTask.Moto_RunTime[GLASS_01] = g_au16MoteTime[SysTask.Moto_Time[GLASS_01]][1];
						SysTask.Moto_SubState[GLASS_01] = MOTO_SUB_STATE_RUN;

						if (SysTask.Moto_Mode[GLASS_01] == MOTO_FR_FWD)
						{
							GPIO_SetBits(MOTO_P_GPIO, MOTO_01_PIN_P); //正转
							GPIO_ResetBits(MOTO_N_GPIO, MOTO_01_PIN_N); //
							SysTask.Moto_State[GLASS_01] = MOTO_STATE_RUN_NOR;
						}
						else if (SysTask.Moto_Mode[GLASS_01] == MOTO_FR_REV)
						{
							GPIO_SetBits(MOTO_N_GPIO, MOTO_01_PIN_N); //反转
							GPIO_ResetBits(MOTO_P_GPIO, MOTO_01_PIN_P); //
							SysTask.Moto_State[GLASS_01] = MOTO_STATE_RUN_NOR;
						}
					}

					break;

				default:
					break;
			}

			break;

