sforganization/NoMaster/STM32F103_1025_Yingshi/HARDWARE/COMMENT/SysComment.c
/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void Moto_04_Task(void)
{
	static u8 u8State	= 0;

	//_04电机
	switch (SysTask.Moto_State[GLASS_04])
	{
		case MOTO_STATE_INIT:
			if (SysTask.Moto_StateTime[GLASS_04] == 0)
			{
				SysTask.Moto_RunTime[GLASS_04] = g_au16MoteTime[SysTask.Moto_Time[GLASS_04]][1];
				SysTask.Moto_State[GLASS_04] = MOTO_STATE_CHANGE_DIR;
				SysTask.Moto_SubState[GLASS_04] = MOTO_SUB_STATE_RUN;
			}

			break;

		case MOTO_STATE_CHANGE_TIME:
			break;

		case MOTO_STATE_CHANGE_DIR:
			if (SysTask.Moto_Mode[GLASS_04] == MOTO_FR_FWD)
			{
				GPIO_SetBits(MOTO_P_GPIO, MOTO_04_PIN_P); //正转
				GPIO_ResetBits(MOTO_N_GPIO, MOTO_04_PIN_N); //
				SysTask.Moto_State[GLASS_04] = MOTO_STATE_RUN_NOR;
			}
			else if (SysTask.Moto_Mode[GLASS_04] == MOTO_FR_REV)
			{
				GPIO_SetBits(MOTO_N_GPIO, MOTO_04_PIN_N); //反转
				GPIO_ResetBits(MOTO_P_GPIO, MOTO_04_PIN_P); //
				SysTask.Moto_State[GLASS_04] = MOTO_STATE_RUN_NOR;
			}
			else if (SysTask.Moto_Mode[GLASS_04] == MOTO_FR_FWD_REV)
			{ //正反转
				u8State 			= 0;
				GPIO_SetBits(MOTO_P_GPIO, MOTO_04_PIN_P); //先正转
				GPIO_ResetBits(MOTO_N_GPIO, MOTO_04_PIN_N); //
				SysTask.Moto_State[GLASS_04] = MOTO_STATE_RUN_CHA;
			}

			SysTask.Moto_ModeSave[GLASS_04] = SysTask.Moto_Mode[GLASS_04];
			break;

		case MOTO_STATE_RUN_NOR: //普通运行状态
			if (SysTask.Moto_Mode[GLASS_04] != SysTask.Moto_ModeSave[GLASS_04])
			{
				GPIO_ResetBits(MOTO_P_GPIO, MOTO_04_PIN_P); //先暂停电机转动
				GPIO_ResetBits(MOTO_N_GPIO, MOTO_04_PIN_N); //先暂停电机转动
				SysTask.Moto_State[GLASS_04] = MOTO_STATE_INIT; //先延时一段时间再翻转
				SysTask.Moto_StateTime[GLASS_04] = 200;
				break;
			}

			switch (SysTask.Moto_SubState[GLASS_04])
			{
				case MOTO_SUB_STATE_RUN:
					if (SysTask.Moto_RunTime[GLASS_04] == 0)
					{
						SysTask.Moto_WaitTime[GLASS_04] = g_au16MoteTime[SysTask.Moto_Time[GLASS_04]][2];
						SysTask.Moto_SubState[GLASS_04] = MOTO_SUB_STATE_WAIT;
						GPIO_ResetBits(MOTO_P_GPIO, MOTO_04_PIN_P); //停止
						GPIO_ResetBits(MOTO_N_GPIO, MOTO_04_PIN_N); //
					}

					break;

				case MOTO_SUB_STATE_WAIT:
					if (SysTask.Moto_WaitTime[GLASS_04] == 0)
					{
						SysTask.Moto_RunTime[GLASS_04] = g_au16MoteTime[SysTask.Moto_Time[GLASS_04]][1];
						SysTask.Moto_SubState[GLASS_04] = MOTO_SUB_STATE_RUN;

						if (SysTask.Moto_Mode[GLASS_04] == MOTO_FR_FWD)
						{
							GPIO_SetBits(MOTO_P_GPIO, MOTO_04_PIN_P); //正转
							GPIO_ResetBits(MOTO_N_GPIO, MOTO_04_PIN_N); //
							SysTask.Moto_State[GLASS_04] = MOTO_STATE_RUN_NOR;
						}
						else if (SysTask.Moto_Mode[GLASS_04] == MOTO_FR_REV)
						{
							GPIO_SetBits(MOTO_N_GPIO, MOTO_04_PIN_N); //反转
							GPIO_ResetBits(MOTO_P_GPIO, MOTO_04_PIN_P); //
							SysTask.Moto_State[GLASS_04] = MOTO_STATE_RUN_NOR;
						}
					}

					break;

				default:
					break;
			}

			break;

		case MOTO_STATE_RUN_CHA: //正反转运行状态
			if (SysTask.Moto_Mode[GLASS_04] != SysTask.Moto_ModeSave[GLASS_04])
			{
				GPIO_ResetBits(MOTO_P_GPIO, MOTO_04_PIN_P); //先暂停电机转动
				GPIO_ResetBits(MOTO_N_GPIO, MOTO_04_PIN_N); //先暂停电机转动
				SysTask.Moto_State[GLASS_04] = MOTO_STATE_INIT; //先延时一段时间再翻转
				break;
			}

			switch (SysTask.Moto_SubState[GLASS_04])
			{
				case MOTO_SUB_STATE_RUN:
					if (SysTask.Moto_RunTime[GLASS_04] == 0)
					{
						SysTask.Moto_WaitTime[GLASS_04] = g_au16MoteTime[SysTask.Moto_Time[GLASS_04]][2];
						SysTask.Moto_SubState[GLASS_04] = MOTO_SUB_STATE_WAIT;
						GPIO_ResetBits(MOTO_P_GPIO, MOTO_04_PIN_P); //停止
						GPIO_ResetBits(MOTO_N_GPIO, MOTO_04_PIN_N); //
					}
					else if (SysTask.Moto_StateTime[GLASS_04] == 0)
					{
						if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_04_PIN) == 0) // //检测到零点	
						{

							SysTask.Moto_StateTime[GLASS_04] = SysTask.nTick + 500; //检测到0点，一段时间后再次检测，避开

							if (u8State == 0)
							{
								u8State 			= 1;
								GPIO_SetBits(MOTO_N_GPIO, MOTO_04_PIN_N); //反转
								GPIO_ResetBits(MOTO_P_GPIO, MOTO_04_PIN_P); //

							}
							else 
							{
								u8State 			= 0;
								GPIO_SetBits(MOTO_P_GPIO, MOTO_04_PIN_P); //先正转
								GPIO_ResetBits(MOTO_N_GPIO, MOTO_04_PIN_N); //
							}
						}

					}

					break;

				case MOTO_SUB_STATE_WAIT:
					if (SysTask.Moto_WaitTime[GLASS_04] == 0)
					{
						u8State 			= 0;
						SysTask.Moto_RunTime[GLASS_04] = g_au16MoteTime[SysTask.Moto_Time[GLASS_04]][1];
						SysTask.Moto_SubState[GLASS_04] = MOTO_SUB_STATE_RUN;
						GPIO_SetBits(MOTO_P_GPIO, MOTO_04_PIN_P); //先正转
						GPIO_ResetBits(MOTO_N_GPIO, MOTO_04_PIN_N); //
					}

					break;

				default:
					break;
			}

			break;

		case MOTO_STATE_STOP:
			if (SysTask.Moto_WaitTime[GLASS_04] == 0)
			{
				GPIO_ResetBits(MOTO_N_GPIO, MOTO_04_PIN_N); //停止
				GPIO_ResetBits(MOTO_P_GPIO, MOTO_04_PIN_P); //

				SysTask.Moto_State[GLASS_04] = MOTO_STATE_IDLE;
			}

			break;

		case MOTO_STATE_WAIT:
			break;

		case MOTO_STATE_IDLE:
			break;

		default:
			break;
	}
}


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void Moto_05_Task(void)
{
	static u8 u8State	= 0;

	//_05电机
	switch (SysTask.Moto_State[GLASS_05])
	{
		case MOTO_STATE_INIT:
			if (SysTask.Moto_StateTime[GLASS_05] == 0)
			{
				SysTask.Moto_RunTime[GLASS_05] = g_au16MoteTime[SysTask.Moto_Time[GLASS_05]][1];
				SysTask.Moto_State[GLASS_05] = MOTO_STATE_CHANGE_DIR;
				SysTask.Moto_SubState[GLASS_05] = MOTO_SUB_STATE_RUN;
			}

			break;

		case MOTO_STATE_CHANGE_TIME:
			break;

		case MOTO_STATE_CHANGE_DIR:
			if (SysTask.Moto_Mode[GLASS_05] == MOTO_FR_FWD)
			{
				GPIO_SetBits(MOTO_P_GPIO, MOTO_05_PIN_P); //正转
				GPIO_ResetBits(MOTO_N_GPIO, MOTO_05_PIN_N); //
				SysTask.Moto_State[GLASS_05] = MOTO_STATE_RUN_NOR;
			}
			else if (SysTask.Moto_Mode[GLASS_05] == MOTO_FR_REV)
			{
				GPIO_SetBits(MOTO_N_GPIO, MOTO_05_PIN_N); //反转
				GPIO_ResetBits(MOTO_P_GPIO, MOTO_05_PIN_P); //
				SysTask.Moto_State[GLASS_05] = MOTO_STATE_RUN_NOR;
			}
			else if (SysTask.Moto_Mode[GLASS_05] == MOTO_FR_FWD_REV)
			{ //正反转
				u8State 			= 0;
				GPIO_SetBits(MOTO_P_GPIO, MOTO_05_PIN_P); //先正转
				GPIO_ResetBits(MOTO_N_GPIO, MOTO_05_PIN_N); //
				SysTask.Moto_State[GLASS_05] = MOTO_STATE_RUN_CHA;
			}

			SysTask.Moto_ModeSave[GLASS_05] = SysTask.Moto_Mode[GLASS_05];
			break;

		case MOTO_STATE_RUN_NOR: //普通运行状态
			if (SysTask.Moto_Mode[GLASS_05] != SysTask.Moto_ModeSave[GLASS_05])
			{
				GPIO_ResetBits(MOTO_P_GPIO, MOTO_05_PIN_P); //先暂停电机转动
				GPIO_ResetBits(MOTO_N_GPIO, MOTO_05_PIN_N); //先暂停电机转动
				SysTask.Moto_State[GLASS_05] = MOTO_STATE_INIT; //先延时一段时间再翻转
				SysTask.Moto_StateTime[GLASS_05] = 200;
				break;
			}

			switch (SysTask.Moto_SubState[GLASS_05])
			{
				case MOTO_SUB_STATE_RUN:
					if (SysTask.Moto_RunTime[GLASS_05] == 0)
					{
						SysTask.Moto_WaitTime[GLASS_05] = g_au16MoteTime[SysTask.Moto_Time[GLASS_05]][2];
						SysTask.Moto_SubState[GLASS_05] = MOTO_SUB_STATE_WAIT;
						GPIO_ResetBits(MOTO_P_GPIO, MOTO_05_PIN_P); //停止
						GPIO_ResetBits(MOTO_N_GPIO, MOTO_05_PIN_N); //
					}

					break;

				case MOTO_SUB_STATE_WAIT:
					if (SysTask.Moto_WaitTime[GLASS_05] == 0)
					{
						SysTask.Moto_RunTime[GLASS_05] = g_au16MoteTime[SysTask.Moto_Time[GLASS_05]][1];
						SysTask.Moto_SubState[GLASS_05] = MOTO_SUB_STATE_RUN;

