sforganization/NoMaster/STM32F103_1025_Yingshi/HARDWARE/COMMENT/SysComment.c
							}
							else 
							{
								u8State 			= 0;
								GPIO_SetBits(MOTO_P_GPIO, MOTO_16_PIN_P); //先正转
								GPIO_ResetBits(MOTO_N_GPIO, MOTO_16_PIN_N); //
							}
						}

					}

					break;

				case MOTO_SUB_STATE_WAIT:
					if (SysTask.Moto_WaitTime[GLASS_16] == 0)
					{
						u8State 			= 0;
						SysTask.Moto_RunTime[GLASS_16] = g_au16MoteTime[SysTask.Moto_Time[GLASS_16]][1];
						SysTask.Moto_SubState[GLASS_16] = MOTO_SUB_STATE_RUN;
						GPIO_SetBits(MOTO_P_GPIO, MOTO_16_PIN_P); //先正转
						GPIO_ResetBits(MOTO_N_GPIO, MOTO_16_PIN_N); //
					}

					break;

				default:
					break;
			}

			break;

		case MOTO_STATE_STOP:
			if (SysTask.Moto_WaitTime[GLASS_16] == 0)
			{
				GPIO_ResetBits(MOTO_N_GPIO, MOTO_16_PIN_N); //停止
				GPIO_ResetBits(MOTO_P_GPIO, MOTO_16_PIN_P); //

				SysTask.Moto_State[GLASS_16] = MOTO_STATE_IDLE;
			}

			break;

		case MOTO_STATE_WAIT:
			break;

		case MOTO_STATE_IDLE:
			break;

		default:
			break;
	}
}


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void Lock_01_Task(void)
{
	static u8 u8ClockCnt = 0;
	static u8 u8ClockPer = 0;

	switch (SysTask.Lock_State[GLASS_01]) //_01锁
	{
		case LOCK_STATE_DETECT:
			if (SysTask.LockMode[GLASS_01] != SysTask.LockModeSave[GLASS_01])
			{
				if (SysTask.LockMode[GLASS_01] == LOCK_ON) //将要开锁
				{
					if (SysTask.Moto_WaitTime[GLASS_01] != 0) //如果电机在停止状态
					{
						SysTask.Moto_WaitTime[GLASS_01] = 0;
					}

					if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_01_PIN) == 0) // //检测到零点 开锁
					{
						SysTask.Lock_StateTime[GLASS_01] = MOTO_DEBOUNCE; //延时40ms到达中点
						SysTask.Moto_WaitTime[GLASS_01] = MOTO_DEBOUNCE;
						SysTask.Lock_State[GLASS_01] = LOCK_STATE_DEBOUNSE;
						SysTask.Moto_State[GLASS_01] = MOTO_STATE_STOP; //停止转动
						SysTask.LockModeSave[GLASS_01] = SysTask.LockMode[GLASS_01];
						SysTask.Lock_OffTime[GLASS_01] = LOCK_OFFTIME;
					}
				}
				else //将要关锁，转动发送3个50ms的低电平
				{
					u8ClockCnt			= 0;
					u8ClockPer			= 0;
					SysTask.LockModeSave[GLASS_01] = SysTask.LockMode[GLASS_01];
					GPIO_SetBits(LOCK_GPIO, LOCK_01_PIN);
					SysTask.Lock_StateTime[GLASS_01] = SysTask.nTick + LOCK_SET_L_TIME;
					SysTask.Lock_State[GLASS_01] = LOCK_STATE_SENT;
				}
			}

			break;

		case LOCK_STATE_DEBOUNSE: //消抖 40ms 到达中点再开锁
			if (SysTask.Lock_StateTime[GLASS_01] == 0)
			{
				if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_01_PIN) == 0) //检测到零点 开锁
				{
					GPIO_ResetBits(LOCK_GPIO, LOCK_01_PIN); //上电，另一边单片机会自己开锁逻辑

					SysTask.Lock_State[GLASS_01] = LOCK_STATE_DETECT;

					if (SysTask.SendState == SEND_IDLE)
						SysTask.SendState = SEND_TABLET_FINGER;

					g_FingerAck 		= ACK_SUCCESS;
					g_AckType			= ZERO_ACK_TYPE;
					g_GlassSendAddr 	= GLASS_01;
				}
			}

			break;

		case LOCK_STATE_SENT: //
			if (SysTask.Lock_StateTime[GLASS_01] != 0)
				break;

			if (u8ClockCnt < 4)
			{
				u8ClockCnt++;

				if (u8ClockPer == 0)
				{
					u8ClockPer			= 1;
					GPIO_ResetBits(LOCK_GPIO, LOCK_01_PIN);
					SysTask.Lock_StateTime[GLASS_01] = SysTask.nTick + LOCK_SET_H_TIME;
				}
				else 
				{
					u8ClockPer			= 0;
					GPIO_SetBits(LOCK_GPIO, LOCK_01_PIN);
					SysTask.Lock_StateTime[GLASS_01] = SysTask.nTick + LOCK_SET_L_TIME;
				}
			}
			else 
			{
				SysTask.Lock_State[GLASS_01] = LOCK_STATE_OFF;
				GPIO_ResetBits(LOCK_GPIO, LOCK_01_PIN);
				SysTask.Lock_StateTime[GLASS_01] = SysTask.nTick + LOCK_SET_OFF_TIME; //停止电平

			}

			break;

		case LOCK_STATE_OFF: //
			if (SysTask.Lock_StateTime[GLASS_01] != 0)
				break;

			GPIO_SetBits(LOCK_GPIO, LOCK_01_PIN);
			SysTask.Lock_StateTime[GLASS_01] = SysTask.nTick + LOCK_SET_L_TIME;
			SysTask.Lock_State[GLASS_01] = LOCK_STATE_DETECT;

			// 因为转动的单片机没有应答我们这边  ，所以这个不用上传到平板端，默认是转动一开始就是成功的
			//			if (SysTask.SendState == SEND_IDLE)
			//				SysTask.SendState = SEND_TABLET_FINGER;
			//			g_FingerAck = ACK_SUCCESS;
			//			g_AckType = ZERO_ACK_TYPE;
			//			g_GlassSendAddr = GLASS_01;
			//	点击了转动，这里让他转动起来
			SysTask.Moto_State[GLASS_01] = MOTO_STATE_INIT; //重新开始转动
			break;

		default:
			break;
	}
}


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void Lock_02_Task(void)
{
	static u8 u8ClockCnt = 0;
	static u8 u8ClockPer = 0;
    
	switch (SysTask.Lock_State[GLASS_02]) //_02锁
	{
		case LOCK_STATE_DETECT:
			if (SysTask.LockMode[GLASS_02] != SysTask.LockModeSave[GLASS_02])
			{
				if (SysTask.LockMode[GLASS_02] == LOCK_ON)
				{
					if (SysTask.Moto_WaitTime[GLASS_02] != 0) //如果电机在停止状态
					{
						SysTask.Moto_WaitTime[GLASS_02] = 0;
					}

					if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_02_PIN) == 0) // //检测到零点 开锁
					{
						SysTask.Lock_StateTime[GLASS_02] = MOTO_DEBOUNCE; //延时40ms到达中点
						SysTask.Moto_WaitTime[GLASS_02] = MOTO_DEBOUNCE;
						SysTask.Lock_State[GLASS_02] = LOCK_STATE_DEBOUNSE;
						SysTask.Moto_State[GLASS_02] = MOTO_STATE_STOP; //停止转动
						SysTask.LockModeSave[GLASS_02] = SysTask.LockMode[GLASS_02];
						SysTask.Lock_OffTime[GLASS_02] = LOCK_OFFTIME;
					}
				}
				else //将要关锁，转动发送3个50ms的低电平
				{
					SysTask.LockModeSave[GLASS_02] = SysTask.LockMode[GLASS_02];
					GPIO_ResetBits(LOCK_GPIO, LOCK_02_PIN);
					u8ClockCnt			= 0;
					u8ClockPer			= 0;
					SysTask.Lock_StateTime[GLASS_02] = SysTask.nTick + LOCK_SET_L_TIME;
					SysTask.Lock_State[GLASS_02] = LOCK_STATE_SENT;
				}
			}

			break;

		case LOCK_STATE_DEBOUNSE:
			if (SysTask.Lock_StateTime[GLASS_02] == 0)
			{
				if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_02_PIN) == 0) // //检测到零点 开锁
				{
					GPIO_SetBits(LOCK_GPIO, LOCK_02_PIN);
					SysTask.Lock_State[GLASS_02] = LOCK_STATE_DETECT;

					if (SysTask.SendState == SEND_IDLE)
						SysTask.SendState = SEND_TABLET_FINGER;

					g_FingerAck 		= ACK_SUCCESS;
					g_AckType			= ZERO_ACK_TYPE;
					g_GlassSendAddr 	= GLASS_02;
				}
			}

			break;

