sforganization/NoMaster/STM32F103_1025_Yingshi/HARDWARE/COMMENT/SysComment.c
		case LOCK_STATE_SENT: //
			if (SysTask.Lock_StateTime[GLASS_02] != 0)
				break;

			if (u8ClockCnt < 4)
			{
				u8ClockCnt++;

				if (u8ClockPer == 0)
				{
					u8ClockPer			= 1;
					GPIO_SetBits(LOCK_GPIO, LOCK_02_PIN);
					SysTask.Lock_StateTime[GLASS_02] = SysTask.nTick + LOCK_SET_H_TIME;
				}
				else 
				{
					u8ClockPer			= 0;
					GPIO_ResetBits(LOCK_GPIO, LOCK_02_PIN);
					SysTask.Lock_StateTime[GLASS_02] = SysTask.nTick + LOCK_SET_L_TIME;
				}
			}
			else 
			{
				SysTask.Lock_State[GLASS_02] = LOCK_STATE_OFF;
				GPIO_SetBits(LOCK_GPIO, LOCK_02_PIN);
				SysTask.Lock_StateTime[GLASS_02] = SysTask.nTick + LOCK_SET_OFF_TIME; //停止电平

			}

			break;

		case LOCK_STATE_OFF: //
			if (SysTask.Lock_StateTime[GLASS_02] != 0)
				break;

			GPIO_ResetBits(LOCK_GPIO, LOCK_02_PIN);
			SysTask.Lock_StateTime[GLASS_02] = SysTask.nTick + LOCK_SET_L_TIME;
			SysTask.Lock_State[GLASS_02] = LOCK_STATE_DETECT;

			//	点击了转动，这里让他转动起来
			SysTask.Moto_State[GLASS_02] = MOTO_STATE_INIT; //重新开始转动
			break;

		default:
			break;
	}
}


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void Lock_03_Task(void)
{
	static u8 u8ClockCnt = 0;
	static u8 u8ClockPer = 0;
	switch (SysTask.Lock_State[GLASS_03]) //_03锁
	{
		case LOCK_STATE_DETECT:
			if (SysTask.LockMode[GLASS_03] != SysTask.LockModeSave[GLASS_03])
			{
				if (SysTask.LockMode[GLASS_03] == LOCK_ON)
				{
					if (SysTask.Moto_WaitTime[GLASS_03] != 0) //如果电机在停止状态
					{
						SysTask.Moto_WaitTime[GLASS_03] = 0;
					}

					if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_03_PIN) == 0) // //检测到零点 开锁
					{
						SysTask.Lock_StateTime[GLASS_03] = MOTO_DEBOUNCE; //延时40ms到达中点
						SysTask.Moto_WaitTime[GLASS_03] = MOTO_DEBOUNCE;
						SysTask.Lock_State[GLASS_03] = LOCK_STATE_DEBOUNSE;
						SysTask.Moto_State[GLASS_03] = MOTO_STATE_STOP; //停止转动
						SysTask.LockModeSave[GLASS_03] = SysTask.LockMode[GLASS_03];
						SysTask.Lock_OffTime[GLASS_03] = LOCK_OFFTIME;
					}
				}
				else 
				{
					SysTask.LockModeSave[GLASS_03] = SysTask.LockMode[GLASS_03];
					GPIO_ResetBits(LOCK_GPIO, LOCK_03_PIN);
					u8ClockCnt			= 0;
					u8ClockPer			= 0;
					SysTask.Lock_StateTime[GLASS_03] = SysTask.nTick + LOCK_SET_L_TIME;
					SysTask.Lock_State[GLASS_03] = LOCK_STATE_SENT;
				}
			}

			break;

		case LOCK_STATE_DEBOUNSE:
			if (SysTask.Lock_StateTime[GLASS_03] == 0)
			{
				if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_03_PIN) == 0) // //检测到零点 开锁
				{
					GPIO_SetBits(LOCK_GPIO, LOCK_03_PIN);
					SysTask.Lock_State[GLASS_03] = LOCK_STATE_DETECT;

					if (SysTask.SendState == SEND_IDLE)
						SysTask.SendState = SEND_TABLET_FINGER;

					g_FingerAck 		= ACK_SUCCESS;
					g_AckType			= ZERO_ACK_TYPE;
					g_GlassSendAddr 	= GLASS_03;
				}
			}

			break;

		case LOCK_STATE_SENT: //
			if (SysTask.Lock_StateTime[GLASS_03] != 0)
				break;

			if (u8ClockCnt < 4)
			{
				u8ClockCnt++;

				if (u8ClockPer == 0)
				{
					u8ClockPer			= 1;
					GPIO_SetBits(LOCK_GPIO, LOCK_03_PIN);
					SysTask.Lock_StateTime[GLASS_03] = SysTask.nTick + LOCK_SET_H_TIME;
				}
				else 
				{
					u8ClockPer			= 0;
					GPIO_ResetBits(LOCK_GPIO, LOCK_03_PIN);
					SysTask.Lock_StateTime[GLASS_03] = SysTask.nTick + LOCK_SET_L_TIME;
				}
			}
			else 
			{
				SysTask.Lock_State[GLASS_03] = LOCK_STATE_OFF;
				GPIO_SetBits(LOCK_GPIO, LOCK_03_PIN);
				SysTask.Lock_StateTime[GLASS_03] = SysTask.nTick + LOCK_SET_OFF_TIME; //停止电平

			}

			break;

		case LOCK_STATE_OFF: //
			if (SysTask.Lock_StateTime[GLASS_03] != 0)
				break;

			GPIO_ResetBits(LOCK_GPIO, LOCK_03_PIN);
			SysTask.Lock_StateTime[GLASS_03] = SysTask.nTick + LOCK_SET_L_TIME;
			SysTask.Lock_State[GLASS_03] = LOCK_STATE_DETECT;

			//	点击了转动，这里让他转动起来
			SysTask.Moto_State[GLASS_03] = MOTO_STATE_INIT; //重新开始转动
			break;

		default:
			break;
	}
}


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void Lock_04_Task(void)
{
	static u8 u8ClockCnt = 0;
	static u8 u8ClockPer = 0;
	switch (SysTask.Lock_State[GLASS_04]) //_04锁
	{
		case LOCK_STATE_DETECT:
			if (SysTask.LockMode[GLASS_04] != SysTask.LockModeSave[GLASS_04])
			{
				if (SysTask.LockMode[GLASS_04] == LOCK_ON)
				{
					if (SysTask.Moto_WaitTime[GLASS_04] != 0) //如果电机在停止状态
					{
						SysTask.Moto_WaitTime[GLASS_04] = 0;
					}

					if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_04_PIN) == 0) // //检测到零点 开锁
					{
						SysTask.Lock_StateTime[GLASS_04] = MOTO_DEBOUNCE; //延时40ms到达中点
						SysTask.Moto_WaitTime[GLASS_04] = MOTO_DEBOUNCE;
						SysTask.Lock_State[GLASS_04] = LOCK_STATE_DEBOUNSE;
						SysTask.Moto_State[GLASS_04] = MOTO_STATE_STOP; //停止转动
						SysTask.LockModeSave[GLASS_04] = SysTask.LockMode[GLASS_04];
						SysTask.Lock_OffTime[GLASS_04] = LOCK_OFFTIME;
					}
				}
				else 
				{
					SysTask.LockModeSave[GLASS_04] = SysTask.LockMode[GLASS_04];
					GPIO_ResetBits(LOCK_GPIO, LOCK_04_PIN);
					u8ClockCnt			= 0;
					u8ClockPer			= 0;
					SysTask.Lock_StateTime[GLASS_04] = SysTask.nTick + LOCK_SET_L_TIME;
					SysTask.Lock_State[GLASS_04] = LOCK_STATE_SENT;
				}
			}

			break;

		case LOCK_STATE_DEBOUNSE:
			if (SysTask.Lock_StateTime[GLASS_04] == 0)
			{
				if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_04_PIN) == 0) // //检测到零点 开锁
				{
					GPIO_SetBits(LOCK_GPIO, LOCK_04_PIN);
					SysTask.Lock_State[GLASS_04] = LOCK_STATE_DETECT;

					if (SysTask.SendState == SEND_IDLE)
						SysTask.SendState = SEND_TABLET_FINGER;

					g_FingerAck 		= ACK_SUCCESS;
					g_AckType			= ZERO_ACK_TYPE;
					g_GlassSendAddr 	= GLASS_04;
				}
			}

			break;

		case LOCK_STATE_SENT: //
			if (SysTask.Lock_StateTime[GLASS_04] != 0)
				break;

			if (u8ClockCnt < 4)
			{
				u8ClockCnt++;

				if (u8ClockPer == 0)
				{
					u8ClockPer			= 1;
					GPIO_SetBits(LOCK_GPIO, LOCK_04_PIN);
					SysTask.Lock_StateTime[GLASS_04] = SysTask.nTick + LOCK_SET_H_TIME;
				}
				else 
				{
					u8ClockPer			= 0;
					GPIO_ResetBits(LOCK_GPIO, LOCK_04_PIN);
					SysTask.Lock_StateTime[GLASS_04] = SysTask.nTick + LOCK_SET_L_TIME;
				}
			}
			else 
			{
				SysTask.Lock_State[GLASS_04] = LOCK_STATE_OFF;
				GPIO_SetBits(LOCK_GPIO, LOCK_04_PIN);
				SysTask.Lock_StateTime[GLASS_04] = SysTask.nTick + LOCK_SET_OFF_TIME; //停止电平

