sforganization/NoMaster/STM32F103_1025_Yingshi/HARDWARE/COMMENT/SysComment.c
			}

			break;

		case LOCK_STATE_OFF: //
			if (SysTask.Lock_StateTime[GLASS_04] != 0)
				break;

			GPIO_ResetBits(LOCK_GPIO, LOCK_04_PIN);
			SysTask.Lock_StateTime[GLASS_04] = SysTask.nTick + LOCK_SET_L_TIME;
			SysTask.Lock_State[GLASS_04] = LOCK_STATE_DETECT;

			//	点击了转动，这里让他转动起来
			SysTask.Moto_State[GLASS_04] = MOTO_STATE_INIT; //重新开始转动
			break;

		default:
			break;
	}
}


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void Lock_05_Task(void)
{
	static u8 u8ClockCnt = 0;
	static u8 u8ClockPer = 0;
	switch (SysTask.Lock_State[GLASS_05]) //_05锁
	{
		case LOCK_STATE_DETECT:
			if (SysTask.LockMode[GLASS_05] != SysTask.LockModeSave[GLASS_05])
			{
				if (SysTask.LockMode[GLASS_05] == LOCK_ON)
				{
					if (SysTask.Moto_WaitTime[GLASS_05] != 0) //如果电机在停止状态
					{
						SysTask.Moto_WaitTime[GLASS_05] = 0;
					}

					if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_05_PIN) == 0) // //检测到零点 开锁
					{
						SysTask.Lock_StateTime[GLASS_05] = MOTO_DEBOUNCE; //延时40ms到达中点
						SysTask.Moto_WaitTime[GLASS_05] = MOTO_DEBOUNCE;
						SysTask.Lock_State[GLASS_05] = LOCK_STATE_DEBOUNSE;
						SysTask.Moto_State[GLASS_05] = MOTO_STATE_STOP; //停止转动
						SysTask.LockModeSave[GLASS_05] = SysTask.LockMode[GLASS_05];
						SysTask.Lock_OffTime[GLASS_05] = LOCK_OFFTIME;
					}
				}
				else 
				{
					SysTask.LockModeSave[GLASS_05] = SysTask.LockMode[GLASS_05];
					GPIO_ResetBits(LOCK_GPIO, LOCK_05_PIN);
					u8ClockCnt			= 0;
					u8ClockPer			= 0;
					SysTask.Lock_StateTime[GLASS_05] = SysTask.nTick + LOCK_SET_L_TIME;
					SysTask.Lock_State[GLASS_05] = LOCK_STATE_SENT;
				}
			}

			break;

		case LOCK_STATE_DEBOUNSE:
			if (SysTask.Lock_StateTime[GLASS_05] == 0)
			{
				if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_05_PIN) == 0) // //检测到零点 开锁
				{
					GPIO_SetBits(LOCK_GPIO, LOCK_05_PIN);
					SysTask.Lock_State[GLASS_05] = LOCK_STATE_DETECT;

					if (SysTask.SendState == SEND_IDLE)
						SysTask.SendState = SEND_TABLET_FINGER;

					g_FingerAck 		= ACK_SUCCESS;
					g_AckType			= ZERO_ACK_TYPE;
					g_GlassSendAddr 	= GLASS_05;
				}
			}

			break;

		case LOCK_STATE_SENT: //
			if (SysTask.Lock_StateTime[GLASS_05] != 0)
				break;

			if (u8ClockCnt < 4)
			{
				u8ClockCnt++;

				if (u8ClockPer == 0)
				{
					u8ClockPer			= 1;
					GPIO_SetBits(LOCK_GPIO, LOCK_05_PIN);
					SysTask.Lock_StateTime[GLASS_05] = SysTask.nTick + LOCK_SET_H_TIME;
				}
				else 
				{
					u8ClockPer			= 0;
					GPIO_ResetBits(LOCK_GPIO, LOCK_05_PIN);
					SysTask.Lock_StateTime[GLASS_05] = SysTask.nTick + LOCK_SET_L_TIME;
				}
			}
			else 
			{
				SysTask.Lock_State[GLASS_05] = LOCK_STATE_OFF;
				GPIO_SetBits(LOCK_GPIO, LOCK_05_PIN);
				SysTask.Lock_StateTime[GLASS_05] = SysTask.nTick + LOCK_SET_OFF_TIME; //停止电平

			}

			break;

		case LOCK_STATE_OFF: //
			if (SysTask.Lock_StateTime[GLASS_05] != 0)
				break;

			GPIO_ResetBits(LOCK_GPIO, LOCK_05_PIN);
			SysTask.Lock_StateTime[GLASS_05] = SysTask.nTick + LOCK_SET_L_TIME;
			SysTask.Lock_State[GLASS_05] = LOCK_STATE_DETECT;

			//	点击了转动，这里让他转动起来
			SysTask.Moto_State[GLASS_05] = MOTO_STATE_INIT; //重新开始转动
			break;

		default:
			break;
	}
}


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void Lock_06_Task(void)
{
	static u8 u8ClockCnt = 0;
	static u8 u8ClockPer = 0;
	switch (SysTask.Lock_State[GLASS_06]) //_06锁
	{
		case LOCK_STATE_DETECT:
			if (SysTask.LockMode[GLASS_06] != SysTask.LockModeSave[GLASS_06])
			{
				if (SysTask.LockMode[GLASS_06] == LOCK_ON)
				{
					if (SysTask.Moto_WaitTime[GLASS_06] != 0) //如果电机在停止状态
					{
						SysTask.Moto_WaitTime[GLASS_06] = 0;
					}

					if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_06_PIN) == 0) // //检测到零点 开锁
					{
						SysTask.Lock_StateTime[GLASS_06] = MOTO_DEBOUNCE; //延时40ms到达中点
						SysTask.Moto_WaitTime[GLASS_06] = MOTO_DEBOUNCE;
						SysTask.Lock_State[GLASS_06] = LOCK_STATE_DEBOUNSE;
						SysTask.Moto_State[GLASS_06] = MOTO_STATE_STOP; //停止转动
						SysTask.LockModeSave[GLASS_06] = SysTask.LockMode[GLASS_06];
						SysTask.Lock_OffTime[GLASS_06] = LOCK_OFFTIME;
					}
				}
				else 
				{
					SysTask.LockModeSave[GLASS_06] = SysTask.LockMode[GLASS_06];
					GPIO_ResetBits(LOCK_GPIO, LOCK_06_PIN);
					u8ClockCnt			= 0;
					u8ClockPer			= 0;
					SysTask.Lock_StateTime[GLASS_06] = SysTask.nTick + LOCK_SET_L_TIME;
					SysTask.Lock_State[GLASS_06] = LOCK_STATE_SENT;
				}
			}

			break;

		case LOCK_STATE_DEBOUNSE:
			if (SysTask.Lock_StateTime[GLASS_06] == 0)
			{
				if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_06_PIN) == 0) // //检测到零点 开锁
				{
					GPIO_SetBits(LOCK_GPIO, LOCK_06_PIN);
					SysTask.Lock_State[GLASS_06] = LOCK_STATE_DETECT;

					if (SysTask.SendState == SEND_IDLE)
						SysTask.SendState = SEND_TABLET_FINGER;

					g_FingerAck 		= ACK_SUCCESS;
					g_AckType			= ZERO_ACK_TYPE;
					g_GlassSendAddr 	= GLASS_06;
				}
			}

			break;

		case LOCK_STATE_SENT: //
			if (SysTask.Lock_StateTime[GLASS_06] != 0)
				break;

			if (u8ClockCnt < 4)
			{
				u8ClockCnt++;

				if (u8ClockPer == 0)
				{
					u8ClockPer			= 1;
					GPIO_SetBits(LOCK_GPIO, LOCK_06_PIN);
					SysTask.Lock_StateTime[GLASS_06] = SysTask.nTick + LOCK_SET_H_TIME;
				}
				else 
				{
					u8ClockPer			= 0;
					GPIO_ResetBits(LOCK_GPIO, LOCK_06_PIN);
					SysTask.Lock_StateTime[GLASS_06] = SysTask.nTick + LOCK_SET_L_TIME;
				}
			}
			else 
			{
				SysTask.Lock_State[GLASS_06] = LOCK_STATE_OFF;
				GPIO_SetBits(LOCK_GPIO, LOCK_06_PIN);
				SysTask.Lock_StateTime[GLASS_06] = SysTask.nTick + LOCK_SET_OFF_TIME; //停止电平

			}

			break;

		case LOCK_STATE_OFF: //
			if (SysTask.Lock_StateTime[GLASS_06] != 0)
				break;

			GPIO_ResetBits(LOCK_GPIO, LOCK_06_PIN);
			SysTask.Lock_StateTime[GLASS_06] = SysTask.nTick + LOCK_SET_L_TIME;
			SysTask.Lock_State[GLASS_06] = LOCK_STATE_DETECT;

