sforganization/NoMaster/STM32F103_1025_Yingshi/HARDWARE/COMMENT/SysComment.c
			//	点击了转动，这里让他转动起来
			SysTask.Moto_State[GLASS_06] = MOTO_STATE_INIT; //重新开始转动
			break;

		default:
			break;
	}
}


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void Lock_07_Task(void)
{
	static u8 u8ClockCnt = 0;
	static u8 u8ClockPer = 0;
	switch (SysTask.Lock_State[GLASS_07]) //_07锁
	{
		case LOCK_STATE_DETECT:
			if (SysTask.LockMode[GLASS_07] != SysTask.LockModeSave[GLASS_07])
			{
				if (SysTask.LockMode[GLASS_07] == LOCK_ON)
				{
					if (SysTask.Moto_WaitTime[GLASS_07] != 0) //如果电机在停止状态
					{
						SysTask.Moto_WaitTime[GLASS_07] = 0;
					}

					if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_07_PIN) == 0) // //检测到零点 开锁
					{
						SysTask.Lock_StateTime[GLASS_07] = MOTO_DEBOUNCE; //延时40ms到达中点
						SysTask.Moto_WaitTime[GLASS_07] = MOTO_DEBOUNCE;
						SysTask.Lock_State[GLASS_07] = LOCK_STATE_DEBOUNSE;
						SysTask.Moto_State[GLASS_07] = MOTO_STATE_STOP; //停止转动
						SysTask.LockModeSave[GLASS_07] = SysTask.LockMode[GLASS_07];
						SysTask.Lock_OffTime[GLASS_07] = LOCK_OFFTIME;
					}
				}
				else 
				{
					SysTask.LockModeSave[GLASS_07] = SysTask.LockMode[GLASS_07];
					GPIO_ResetBits(LOCK_GPIO, LOCK_07_PIN);
					u8ClockCnt			= 0;
					u8ClockPer			= 0;
					SysTask.Lock_StateTime[GLASS_07] = SysTask.nTick + LOCK_SET_L_TIME;
					SysTask.Lock_State[GLASS_07] = LOCK_STATE_SENT;
				}
			}

			break;

		case LOCK_STATE_DEBOUNSE:
			if (SysTask.Lock_StateTime[GLASS_07] == 0)
			{
				if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_07_PIN) == 0) // //检测到零点 开锁
				{
					GPIO_SetBits(LOCK_GPIO, LOCK_07_PIN);
					SysTask.Lock_State[GLASS_07] = LOCK_STATE_DETECT;

					if (SysTask.SendState == SEND_IDLE)
						SysTask.SendState = SEND_TABLET_FINGER;

					g_FingerAck 		= ACK_SUCCESS;
					g_AckType			= ZERO_ACK_TYPE;
					g_GlassSendAddr 	= GLASS_07;
				}
			}

			break;

		case LOCK_STATE_SENT: //
			if (SysTask.Lock_StateTime[GLASS_07] != 0)
				break;

			if (u8ClockCnt < 4)
			{
				u8ClockCnt++;

				if (u8ClockPer == 0)
				{
					u8ClockPer			= 1;
					GPIO_SetBits(LOCK_GPIO, LOCK_07_PIN);
					SysTask.Lock_StateTime[GLASS_07] = SysTask.nTick + LOCK_SET_H_TIME;
				}
				else 
				{
					u8ClockPer			= 0;
					GPIO_ResetBits(LOCK_GPIO, LOCK_07_PIN);
					SysTask.Lock_StateTime[GLASS_07] = SysTask.nTick + LOCK_SET_L_TIME;
				}
			}
			else 
			{
				SysTask.Lock_State[GLASS_07] = LOCK_STATE_OFF;
				GPIO_SetBits(LOCK_GPIO, LOCK_07_PIN);
				SysTask.Lock_StateTime[GLASS_07] = SysTask.nTick + LOCK_SET_OFF_TIME; //停止电平

			}

			break;

		case LOCK_STATE_OFF: //
			if (SysTask.Lock_StateTime[GLASS_07] != 0)
				break;

			GPIO_ResetBits(LOCK_GPIO, LOCK_07_PIN);
			SysTask.Lock_StateTime[GLASS_07] = SysTask.nTick + LOCK_SET_L_TIME;
			SysTask.Lock_State[GLASS_07] = LOCK_STATE_DETECT;

			//	点击了转动，这里让他转动起来
			SysTask.Moto_State[GLASS_07] = MOTO_STATE_INIT; //重新开始转动
			break;

		default:
			break;
	}
}


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void Lock_08_Task(void)
{
	static u8 u8ClockCnt = 0;
	static u8 u8ClockPer = 0;
	switch (SysTask.Lock_State[GLASS_08]) //_08锁
	{
		case LOCK_STATE_DETECT:
			if (SysTask.LockMode[GLASS_08] != SysTask.LockModeSave[GLASS_08])
			{
				if (SysTask.LockMode[GLASS_08] == LOCK_ON)
				{
					if (SysTask.Moto_WaitTime[GLASS_08] != 0) //如果电机在停止状态
					{
						SysTask.Moto_WaitTime[GLASS_08] = 0;
					}

					if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_08_PIN) == 0) // //检测到零点 开锁
					{
						SysTask.Lock_StateTime[GLASS_08] = MOTO_DEBOUNCE; //延时40ms到达中点
						SysTask.Moto_WaitTime[GLASS_08] = MOTO_DEBOUNCE;
						SysTask.Lock_State[GLASS_08] = LOCK_STATE_DEBOUNSE;
						SysTask.Moto_State[GLASS_08] = MOTO_STATE_STOP; //停止转动
						SysTask.LockModeSave[GLASS_08] = SysTask.LockMode[GLASS_08];
						SysTask.Lock_OffTime[GLASS_08] = LOCK_OFFTIME;
					}
				}
				else 
				{
					SysTask.LockModeSave[GLASS_08] = SysTask.LockMode[GLASS_08];
					GPIO_ResetBits(LOCK_GPIO, LOCK_08_PIN);
					u8ClockCnt			= 0;
					u8ClockPer			= 0;
					SysTask.Lock_StateTime[GLASS_08] = SysTask.nTick + LOCK_SET_L_TIME;
					SysTask.Lock_State[GLASS_08] = LOCK_STATE_SENT;
				}
			}

			break;

		case LOCK_STATE_DEBOUNSE:
			if (SysTask.Lock_StateTime[GLASS_08] == 0)
			{
				if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_08_PIN) == 0) // //检测到零点 开锁
				{
					GPIO_SetBits(LOCK_GPIO, LOCK_08_PIN);
					SysTask.Lock_State[GLASS_08] = LOCK_STATE_DETECT;

					if (SysTask.SendState == SEND_IDLE)
						SysTask.SendState = SEND_TABLET_FINGER;

					g_FingerAck 		= ACK_SUCCESS;
					g_AckType			= ZERO_ACK_TYPE;
					g_GlassSendAddr 	= GLASS_08;
				}
			}

			break;

		case LOCK_STATE_SENT: //
			if (SysTask.Lock_StateTime[GLASS_08] != 0)
				break;

			if (u8ClockCnt < 4)
			{
				u8ClockCnt++;

				if (u8ClockPer == 0)
				{
					u8ClockPer			= 1;
					GPIO_SetBits(LOCK_GPIO, LOCK_08_PIN);
					SysTask.Lock_StateTime[GLASS_08] = SysTask.nTick + LOCK_SET_H_TIME;
				}
				else 
				{
					u8ClockPer			= 0;
					GPIO_ResetBits(LOCK_GPIO, LOCK_08_PIN);
					SysTask.Lock_StateTime[GLASS_08] = SysTask.nTick + LOCK_SET_L_TIME;
				}
			}
			else 
			{
				SysTask.Lock_State[GLASS_08] = LOCK_STATE_OFF;
				GPIO_SetBits(LOCK_GPIO, LOCK_08_PIN);
				SysTask.Lock_StateTime[GLASS_08] = SysTask.nTick + LOCK_SET_OFF_TIME; //停止电平

			}

			break;

		case LOCK_STATE_OFF: //
			if (SysTask.Lock_StateTime[GLASS_08] != 0)
				break;

			GPIO_ResetBits(LOCK_GPIO, LOCK_08_PIN);
			SysTask.Lock_StateTime[GLASS_08] = SysTask.nTick + LOCK_SET_L_TIME;
			SysTask.Lock_State[GLASS_08] = LOCK_STATE_DETECT;

			//	点击了转动，这里让他转动起来
			SysTask.Moto_State[GLASS_08] = MOTO_STATE_INIT; //重新开始转动
			break;

		default:
			break;
	}
}


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void Lock_09_Task(void)
{
	static u8 u8ClockCnt = 0;
	static u8 u8ClockPer = 0;
	switch (SysTask.Lock_State[GLASS_09]) //_09锁
	{
		case LOCK_STATE_DETECT:
			if (SysTask.LockMode[GLASS_09] != SysTask.LockModeSave[GLASS_09])
			{
				if (SysTask.LockMode[GLASS_09] == LOCK_ON)
				{
					if (SysTask.Moto_WaitTime[GLASS_09] != 0) //如果电机在停止状态
					{
						SysTask.Moto_WaitTime[GLASS_09] = 0;
					}

					if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_09_PIN) == 0) // //检测到零点 开锁
					{
						SysTask.Lock_StateTime[GLASS_09] = MOTO_DEBOUNCE; //延时40ms到达中点
						SysTask.Moto_WaitTime[GLASS_09] = MOTO_DEBOUNCE;
						SysTask.Lock_State[GLASS_09] = LOCK_STATE_DEBOUNSE;
						SysTask.Moto_State[GLASS_09] = MOTO_STATE_STOP; //停止转动
						SysTask.LockModeSave[GLASS_09] = SysTask.LockMode[GLASS_09];
						SysTask.Lock_OffTime[GLASS_09] = LOCK_OFFTIME;
					}
				}
				else 
				{
					SysTask.LockModeSave[GLASS_09] = SysTask.LockMode[GLASS_09];
					GPIO_ResetBits(LOCK_GPIO, LOCK_09_PIN);
					u8ClockCnt			= 0;
					u8ClockPer			= 0;
					SysTask.Lock_StateTime[GLASS_09] = SysTask.nTick + LOCK_SET_L_TIME;
					SysTask.Lock_State[GLASS_09] = LOCK_STATE_SENT;
				}
			}

			break;

