sforganization/NoMaster/STM32F103_1025_Yingshi/HARDWARE/COMMENT/SysComment.c
		case LOCK_STATE_DEBOUNSE:
			if (SysTask.Lock_StateTime[GLASS_09] == 0)
			{
				if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_09_PIN) == 0) // //检测到零点 开锁
				{
					GPIO_SetBits(LOCK_GPIO, LOCK_09_PIN);
					SysTask.Lock_State[GLASS_09] = LOCK_STATE_DETECT;

					if (SysTask.SendState == SEND_IDLE)
						SysTask.SendState = SEND_TABLET_FINGER;

					g_FingerAck 		= ACK_SUCCESS;
					g_AckType			= ZERO_ACK_TYPE;
					g_GlassSendAddr 	= GLASS_09;
				}
			}

			break;

		case LOCK_STATE_SENT: //
			if (SysTask.Lock_StateTime[GLASS_09] != 0)
				break;

			if (u8ClockCnt < 4)
			{
				u8ClockCnt++;

				if (u8ClockPer == 0)
				{
					u8ClockPer			= 1;
					GPIO_SetBits(LOCK_GPIO, LOCK_09_PIN);
					SysTask.Lock_StateTime[GLASS_09] = SysTask.nTick + LOCK_SET_H_TIME;
				}
				else 
				{
					u8ClockPer			= 0;
					GPIO_ResetBits(LOCK_GPIO, LOCK_09_PIN);
					SysTask.Lock_StateTime[GLASS_09] = SysTask.nTick + LOCK_SET_L_TIME;
				}
			}
			else 
			{
				SysTask.Lock_State[GLASS_09] = LOCK_STATE_OFF;
				GPIO_SetBits(LOCK_GPIO, LOCK_09_PIN);
				SysTask.Lock_StateTime[GLASS_09] = SysTask.nTick + LOCK_SET_OFF_TIME; //停止电平

			}

			break;

		case LOCK_STATE_OFF: //
			if (SysTask.Lock_StateTime[GLASS_09] != 0)
				break;

			GPIO_ResetBits(LOCK_GPIO, LOCK_09_PIN);
			SysTask.Lock_StateTime[GLASS_09] = SysTask.nTick + LOCK_SET_L_TIME;
			SysTask.Lock_State[GLASS_09] = LOCK_STATE_DETECT;

			//	点击了转动，这里让他转动起来
			SysTask.Moto_State[GLASS_09] = MOTO_STATE_INIT; //重新开始转动
			break;

		default:
			break;
	}
}


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void Lock_10_Task(void)
{
	static u8 u8ClockCnt = 0;
	static u8 u8ClockPer = 0;
	switch (SysTask.Lock_State[GLASS_10]) //_10锁
	{
		case LOCK_STATE_DETECT:
			if (SysTask.LockMode[GLASS_10] != SysTask.LockModeSave[GLASS_10])
			{
				if (SysTask.LockMode[GLASS_10] == LOCK_ON)
				{
					if (SysTask.Moto_WaitTime[GLASS_10] != 0) //如果电机在停止状态
					{
						SysTask.Moto_WaitTime[GLASS_10] = 0;
					}

					if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_10_PIN) == 0) // //检测到零点 开锁
					{
						SysTask.Lock_StateTime[GLASS_10] = MOTO_DEBOUNCE; //延时40ms到达中点
						SysTask.Moto_WaitTime[GLASS_10] = MOTO_DEBOUNCE;
						SysTask.Lock_State[GLASS_10] = LOCK_STATE_DEBOUNSE;
						SysTask.Moto_State[GLASS_10] = MOTO_STATE_STOP; //停止转动
						SysTask.LockModeSave[GLASS_10] = SysTask.LockMode[GLASS_10];
						SysTask.Lock_OffTime[GLASS_10] = LOCK_OFFTIME;
					}
				}
				else 
				{
					SysTask.LockModeSave[GLASS_10] = SysTask.LockMode[GLASS_10];
					GPIO_ResetBits(LOCK_GPIO, LOCK_10_PIN);
					u8ClockCnt			= 0;
					u8ClockPer			= 0;
					SysTask.Lock_StateTime[GLASS_10] = SysTask.nTick + LOCK_SET_L_TIME;
					SysTask.Lock_State[GLASS_10] = LOCK_STATE_SENT;
				}
			}

			break;

		case LOCK_STATE_DEBOUNSE:
			if (SysTask.Lock_StateTime[GLASS_10] == 0)
			{
				if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_10_PIN) == 0) // //检测到零点 开锁
				{
					GPIO_SetBits(LOCK_GPIO, LOCK_10_PIN);
					SysTask.Lock_State[GLASS_10] = LOCK_STATE_DETECT;

					if (SysTask.SendState == SEND_IDLE)
						SysTask.SendState = SEND_TABLET_FINGER;

					g_FingerAck 		= ACK_SUCCESS;
					g_AckType			= ZERO_ACK_TYPE;
					g_GlassSendAddr 	= GLASS_10;
				}
			}

			break;

		case LOCK_STATE_SENT: //
			if (SysTask.Lock_StateTime[GLASS_10] != 0)
				break;

			if (u8ClockCnt < 4)
			{
				u8ClockCnt++;

				if (u8ClockPer == 0)
				{
					u8ClockPer			= 1;
					GPIO_SetBits(LOCK_GPIO, LOCK_10_PIN);
					SysTask.Lock_StateTime[GLASS_10] = SysTask.nTick + LOCK_SET_H_TIME;
				}
				else 
				{
					u8ClockPer			= 0;
					GPIO_ResetBits(LOCK_GPIO, LOCK_10_PIN);
					SysTask.Lock_StateTime[GLASS_10] = SysTask.nTick + LOCK_SET_L_TIME;
				}
			}
			else 
			{
				SysTask.Lock_State[GLASS_10] = LOCK_STATE_OFF;
				GPIO_SetBits(LOCK_GPIO, LOCK_10_PIN);
				SysTask.Lock_StateTime[GLASS_10] = SysTask.nTick + LOCK_SET_OFF_TIME; //停止电平

			}

			break;

		case LOCK_STATE_OFF: //
			if (SysTask.Lock_StateTime[GLASS_10] != 0)
				break;

			GPIO_ResetBits(LOCK_GPIO, LOCK_10_PIN);
			SysTask.Lock_StateTime[GLASS_10] = SysTask.nTick + LOCK_SET_L_TIME;
			SysTask.Lock_State[GLASS_10] = LOCK_STATE_DETECT;

			//	点击了转动，这里让他转动起来
			SysTask.Moto_State[GLASS_10] = MOTO_STATE_INIT; //重新开始转动
			break;

		default:
			break;
	}
}


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void Lock_11_Task(void)
{
	static u8 u8ClockCnt = 0;
	static u8 u8ClockPer = 0;
	switch (SysTask.Lock_State[GLASS_11]) //_11锁
	{
		case LOCK_STATE_DETECT:
			if (SysTask.LockMode[GLASS_11] != SysTask.LockModeSave[GLASS_11])
			{
				if (SysTask.LockMode[GLASS_11] == LOCK_ON)
				{
					if (SysTask.Moto_WaitTime[GLASS_11] != 0) //如果电机在停止状态
					{
						SysTask.Moto_WaitTime[GLASS_11] = 0;
					}

					if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_11_PIN) == 0) // //检测到零点 开锁
					{
						SysTask.Lock_StateTime[GLASS_11] = MOTO_DEBOUNCE; //延时40ms到达中点
						SysTask.Moto_WaitTime[GLASS_11] = MOTO_DEBOUNCE;
						SysTask.Lock_State[GLASS_11] = LOCK_STATE_DEBOUNSE;
						SysTask.Moto_State[GLASS_11] = MOTO_STATE_STOP; //停止转动
						SysTask.LockModeSave[GLASS_11] = SysTask.LockMode[GLASS_11];
						SysTask.Lock_OffTime[GLASS_11] = LOCK_OFFTIME;
					}
				}
				else 
				{
					SysTask.LockModeSave[GLASS_11] = SysTask.LockMode[GLASS_11];
					GPIO_ResetBits(LOCK_GPIO, LOCK_11_PIN);
					u8ClockCnt			= 0;
					u8ClockPer			= 0;
					SysTask.Lock_StateTime[GLASS_11] = SysTask.nTick + LOCK_SET_L_TIME;
					SysTask.Lock_State[GLASS_11] = LOCK_STATE_SENT;
				}
			}

			break;

		case LOCK_STATE_DEBOUNSE:
			if (SysTask.Lock_StateTime[GLASS_11] == 0)
			{
				if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_11_PIN) == 0) // //检测到零点 开锁
				{
					GPIO_SetBits(LOCK_GPIO, LOCK_11_PIN);
					SysTask.Lock_State[GLASS_11] = LOCK_STATE_DETECT;

					if (SysTask.SendState == SEND_IDLE)
						SysTask.SendState = SEND_TABLET_FINGER;

					g_FingerAck 		= ACK_SUCCESS;
					g_AckType			= ZERO_ACK_TYPE;
					g_GlassSendAddr 	= GLASS_11;
				}
			}

			break;

