sforganization/NoMaster/STM32F103_1025_Yingshi/HARDWARE/COMMENT/SysComment.c
		case LOCK_STATE_SENT: //
			if (SysTask.Lock_StateTime[GLASS_11] != 0)
				break;

			if (u8ClockCnt < 4)
			{
				u8ClockCnt++;

				if (u8ClockPer == 0)
				{
					u8ClockPer			= 1;
					GPIO_SetBits(LOCK_GPIO, LOCK_11_PIN);
					SysTask.Lock_StateTime[GLASS_11] = SysTask.nTick + LOCK_SET_H_TIME;
				}
				else 
				{
					u8ClockPer			= 0;
					GPIO_ResetBits(LOCK_GPIO, LOCK_11_PIN);
					SysTask.Lock_StateTime[GLASS_11] = SysTask.nTick + LOCK_SET_L_TIME;
				}
			}
			else 
			{
				SysTask.Lock_State[GLASS_11] = LOCK_STATE_OFF;
				GPIO_SetBits(LOCK_GPIO, LOCK_11_PIN);
				SysTask.Lock_StateTime[GLASS_11] = SysTask.nTick + LOCK_SET_OFF_TIME; //停止电平

			}

			break;

		case LOCK_STATE_OFF: //
			if (SysTask.Lock_StateTime[GLASS_11] != 0)
				break;

			GPIO_ResetBits(LOCK_GPIO, LOCK_11_PIN);
			SysTask.Lock_StateTime[GLASS_11] = SysTask.nTick + LOCK_SET_L_TIME;
			SysTask.Lock_State[GLASS_11] = LOCK_STATE_DETECT;

			//	点击了转动，这里让他转动起来
			SysTask.Moto_State[GLASS_11] = MOTO_STATE_INIT; //重新开始转动
			break;

		default:
			break;
	}
}


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void Lock_12_Task(void)
{
	static u8 u8ClockCnt = 0;
	static u8 u8ClockPer = 0;
	switch (SysTask.Lock_State[GLASS_12]) //_12锁
	{
		case LOCK_STATE_DETECT:
			if (SysTask.LockMode[GLASS_12] != SysTask.LockModeSave[GLASS_12])
			{
				if (SysTask.LockMode[GLASS_12] == LOCK_ON)
				{
					if (SysTask.Moto_WaitTime[GLASS_12] != 0) //如果电机在停止状态
					{
						SysTask.Moto_WaitTime[GLASS_12] = 0;
					}

					if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_12_PIN) == 0) // //检测到零点 开锁
					{
						SysTask.Lock_StateTime[GLASS_12] = MOTO_DEBOUNCE; //延时40ms到达中点
						SysTask.Moto_WaitTime[GLASS_12] = MOTO_DEBOUNCE;
						SysTask.Lock_State[GLASS_12] = LOCK_STATE_DEBOUNSE;
						SysTask.Moto_State[GLASS_12] = MOTO_STATE_STOP; //停止转动
						SysTask.LockModeSave[GLASS_12] = SysTask.LockMode[GLASS_12];
						SysTask.Lock_OffTime[GLASS_12] = LOCK_OFFTIME;
					}
				}
				else 
				{
					SysTask.LockModeSave[GLASS_12] = SysTask.LockMode[GLASS_12];
					GPIO_ResetBits(LOCK_GPIO, LOCK_12_PIN);
					u8ClockCnt			= 0;
					u8ClockPer			= 0;
					SysTask.Lock_StateTime[GLASS_12] = SysTask.nTick + LOCK_SET_L_TIME;
					SysTask.Lock_State[GLASS_12] = LOCK_STATE_SENT;
				}
			}

			break;

		case LOCK_STATE_DEBOUNSE:
			if (SysTask.Lock_StateTime[GLASS_12] == 0)
			{
				if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_12_PIN) == 0) // //检测到零点 开锁
				{
					GPIO_SetBits(LOCK_GPIO, LOCK_12_PIN);
					SysTask.Lock_State[GLASS_12] = LOCK_STATE_DETECT;

					if (SysTask.SendState == SEND_IDLE)
						SysTask.SendState = SEND_TABLET_FINGER;

					g_FingerAck 		= ACK_SUCCESS;
					g_AckType			= ZERO_ACK_TYPE;
					g_GlassSendAddr 	= GLASS_12;
				}
			}

			break;

		case LOCK_STATE_SENT: //
			if (SysTask.Lock_StateTime[GLASS_12] != 0)
				break;

			if (u8ClockCnt < 4)
			{
				u8ClockCnt++;

				if (u8ClockPer == 0)
				{
					u8ClockPer			= 1;
					GPIO_SetBits(LOCK_GPIO, LOCK_12_PIN);
					SysTask.Lock_StateTime[GLASS_12] = SysTask.nTick + LOCK_SET_H_TIME;
				}
				else 
				{
					u8ClockPer			= 0;
					GPIO_ResetBits(LOCK_GPIO, LOCK_12_PIN);
					SysTask.Lock_StateTime[GLASS_12] = SysTask.nTick + LOCK_SET_L_TIME;
				}
			}
			else 
			{
				SysTask.Lock_State[GLASS_12] = LOCK_STATE_OFF;
				GPIO_SetBits(LOCK_GPIO, LOCK_12_PIN);
				SysTask.Lock_StateTime[GLASS_12] = SysTask.nTick + LOCK_SET_OFF_TIME; //停止电平

			}

			break;

		case LOCK_STATE_OFF: //
			if (SysTask.Lock_StateTime[GLASS_12] != 0)
				break;

			GPIO_ResetBits(LOCK_GPIO, LOCK_12_PIN);
			SysTask.Lock_StateTime[GLASS_12] = SysTask.nTick + LOCK_SET_L_TIME;
			SysTask.Lock_State[GLASS_12] = LOCK_STATE_DETECT;

			//	点击了转动，这里让他转动起来
			SysTask.Moto_State[GLASS_12] = MOTO_STATE_INIT; //重新开始转动
			break;

		default:
			break;
	}
}


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void Lock_13_Task(void)
{
	static u8 u8ClockCnt = 0;
	static u8 u8ClockPer = 0;
	switch (SysTask.Lock_State[GLASS_13]) //_13锁
	{
		case LOCK_STATE_DETECT:
			if (SysTask.LockMode[GLASS_13] != SysTask.LockModeSave[GLASS_13])
			{
				if (SysTask.LockMode[GLASS_13] == LOCK_ON)
				{
					if (SysTask.Moto_WaitTime[GLASS_13] != 0) //如果电机在停止状态
					{
						SysTask.Moto_WaitTime[GLASS_13] = 0;
					}

					if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_13_PIN) == 0) // //检测到零点 开锁
					{
						SysTask.Lock_StateTime[GLASS_13] = MOTO_DEBOUNCE; //延时40ms到达中点
						SysTask.Moto_WaitTime[GLASS_13] = MOTO_DEBOUNCE;
						SysTask.Lock_State[GLASS_13] = LOCK_STATE_DEBOUNSE;
						SysTask.Moto_State[GLASS_13] = MOTO_STATE_STOP; //停止转动
						SysTask.LockModeSave[GLASS_13] = SysTask.LockMode[GLASS_13];
						SysTask.Lock_OffTime[GLASS_13] = LOCK_OFFTIME;
					}
				}
				else 
				{
					SysTask.LockModeSave[GLASS_13] = SysTask.LockMode[GLASS_13];
					GPIO_ResetBits(LOCK_GPIO, LOCK_13_PIN);
					u8ClockCnt			= 0;
					u8ClockPer			= 0;
					SysTask.Lock_StateTime[GLASS_13] = SysTask.nTick + LOCK_SET_L_TIME;
					SysTask.Lock_State[GLASS_13] = LOCK_STATE_SENT;
				}
			}

			break;

		case LOCK_STATE_DEBOUNSE:
			if (SysTask.Lock_StateTime[GLASS_13] == 0)
			{
				if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_13_PIN) == 0) // //检测到零点 开锁
				{
					GPIO_SetBits(LOCK_GPIO, LOCK_13_PIN);
					SysTask.Lock_State[GLASS_13] = LOCK_STATE_DETECT;

					if (SysTask.SendState == SEND_IDLE)
						SysTask.SendState = SEND_TABLET_FINGER;

					g_FingerAck 		= ACK_SUCCESS;
					g_AckType			= ZERO_ACK_TYPE;
					g_GlassSendAddr 	= GLASS_13;
				}
			}

			break;

		case LOCK_STATE_SENT: //
			if (SysTask.Lock_StateTime[GLASS_13] != 0)
				break;

			if (u8ClockCnt < 4)
			{
				u8ClockCnt++;

				if (u8ClockPer == 0)
				{
					u8ClockPer			= 1;
					GPIO_SetBits(LOCK_GPIO, LOCK_13_PIN);
					SysTask.Lock_StateTime[GLASS_13] = SysTask.nTick + LOCK_SET_H_TIME;
				}
				else 
				{
					u8ClockPer			= 0;
					GPIO_ResetBits(LOCK_GPIO, LOCK_13_PIN);
					SysTask.Lock_StateTime[GLASS_13] = SysTask.nTick + LOCK_SET_L_TIME;
				}
			}
			else 
			{
				SysTask.Lock_State[GLASS_13] = LOCK_STATE_OFF;
				GPIO_SetBits(LOCK_GPIO, LOCK_13_PIN);
				SysTask.Lock_StateTime[GLASS_13] = SysTask.nTick + LOCK_SET_OFF_TIME; //停止电平

