sforganization/NoMaster/STM32F103_1025_Yingshi/HARDWARE/COMMENT/SysComment.c
			}

			break;

		case LOCK_STATE_OFF: //
			if (SysTask.Lock_StateTime[GLASS_13] != 0)
				break;

			GPIO_ResetBits(LOCK_GPIO, LOCK_13_PIN);
			SysTask.Lock_StateTime[GLASS_13] = SysTask.nTick + LOCK_SET_L_TIME;
			SysTask.Lock_State[GLASS_13] = LOCK_STATE_DETECT;

			//	点击了转动，这里让他转动起来
			SysTask.Moto_State[GLASS_13] = MOTO_STATE_INIT; //重新开始转动
			break;

		default:
			break;
	}
}


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void Lock_14_Task(void)
{
	static u8 u8ClockCnt = 0;
	static u8 u8ClockPer = 0;
	switch (SysTask.Lock_State[GLASS_14]) //_14锁
	{
		case LOCK_STATE_DETECT:
			if (SysTask.LockMode[GLASS_14] != SysTask.LockModeSave[GLASS_14])
			{
				if (SysTask.LockMode[GLASS_14] == LOCK_ON)
				{
					if (SysTask.Moto_WaitTime[GLASS_14] != 0) //如果电机在停止状态
					{
						SysTask.Moto_WaitTime[GLASS_14] = 0;
					}

					if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_14_PIN) == 0) // //检测到零点 开锁
					{
						SysTask.Lock_StateTime[GLASS_14] = MOTO_DEBOUNCE; //延时40ms到达中点
						SysTask.Moto_WaitTime[GLASS_14] = MOTO_DEBOUNCE;
						SysTask.Lock_State[GLASS_14] = LOCK_STATE_DEBOUNSE;
						SysTask.Moto_State[GLASS_14] = MOTO_STATE_STOP; //停止转动
						SysTask.LockModeSave[GLASS_14] = SysTask.LockMode[GLASS_14];
						SysTask.Lock_OffTime[GLASS_14] = LOCK_OFFTIME;
					}
				}
				else 
				{
					SysTask.LockModeSave[GLASS_14] = SysTask.LockMode[GLASS_14];
					GPIO_ResetBits(LOCK_GPIO, LOCK_14_PIN);
					u8ClockCnt			= 0;
					u8ClockPer			= 0;
					SysTask.Lock_StateTime[GLASS_14] = SysTask.nTick + LOCK_SET_L_TIME;
					SysTask.Lock_State[GLASS_14] = LOCK_STATE_SENT;
				}
			}

			break;

		case LOCK_STATE_DEBOUNSE:
			if (SysTask.Lock_StateTime[GLASS_14] == 0)
			{
				if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_14_PIN) == 0) // //检测到零点 开锁
				{
					GPIO_SetBits(LOCK_GPIO, LOCK_14_PIN);
					SysTask.Lock_State[GLASS_14] = LOCK_STATE_DETECT;

					if (SysTask.SendState == SEND_IDLE)
						SysTask.SendState = SEND_TABLET_FINGER;

					g_FingerAck 		= ACK_SUCCESS;
					g_AckType			= ZERO_ACK_TYPE;
					g_GlassSendAddr 	= GLASS_14;
				}
			}

			break;

		case LOCK_STATE_SENT: //
			if (SysTask.Lock_StateTime[GLASS_14] != 0)
				break;

			if (u8ClockCnt < 4)
			{
				u8ClockCnt++;

				if (u8ClockPer == 0)
				{
					u8ClockPer			= 1;
					GPIO_SetBits(LOCK_GPIO, LOCK_14_PIN);
					SysTask.Lock_StateTime[GLASS_14] = SysTask.nTick + LOCK_SET_H_TIME;
				}
				else 
				{
					u8ClockPer			= 0;
					GPIO_ResetBits(LOCK_GPIO, LOCK_14_PIN);
					SysTask.Lock_StateTime[GLASS_14] = SysTask.nTick + LOCK_SET_L_TIME;
				}
			}
			else 
			{
				SysTask.Lock_State[GLASS_14] = LOCK_STATE_OFF;
				GPIO_SetBits(LOCK_GPIO, LOCK_14_PIN);
				SysTask.Lock_StateTime[GLASS_14] = SysTask.nTick + LOCK_SET_OFF_TIME; //停止电平

			}

			break;

		case LOCK_STATE_OFF: //
			if (SysTask.Lock_StateTime[GLASS_14] != 0)
				break;

			GPIO_ResetBits(LOCK_GPIO, LOCK_14_PIN);
			SysTask.Lock_StateTime[GLASS_14] = SysTask.nTick + LOCK_SET_L_TIME;
			SysTask.Lock_State[GLASS_14] = LOCK_STATE_DETECT;

			//	点击了转动，这里让他转动起来
			SysTask.Moto_State[GLASS_14] = MOTO_STATE_INIT; //重新开始转动
			break;

		default:
			break;
	}
}


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void Lock_15_Task(void)
{
	static u8 u8ClockCnt = 0;
	static u8 u8ClockPer = 0;
	switch (SysTask.Lock_State[GLASS_15]) //_15锁
	{
		case LOCK_STATE_DETECT:
			if (SysTask.LockMode[GLASS_15] != SysTask.LockModeSave[GLASS_15])
			{
				if (SysTask.LockMode[GLASS_15] == LOCK_ON)
				{
					if (SysTask.Moto_WaitTime[GLASS_15] != 0) //如果电机在停止状态
					{
						SysTask.Moto_WaitTime[GLASS_15] = 0;
					}

					if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_15_PIN) == 0) // //检测到零点 开锁
					{
						SysTask.Lock_StateTime[GLASS_15] = MOTO_DEBOUNCE; //延时40ms到达中点
						SysTask.Moto_WaitTime[GLASS_15] = MOTO_DEBOUNCE;
						SysTask.Lock_State[GLASS_15] = LOCK_STATE_DEBOUNSE;
						SysTask.Moto_State[GLASS_15] = MOTO_STATE_STOP; //停止转动
						SysTask.LockModeSave[GLASS_15] = SysTask.LockMode[GLASS_15];
						SysTask.Lock_OffTime[GLASS_15] = LOCK_OFFTIME;
					}
				}
				else 
				{
					SysTask.LockModeSave[GLASS_15] = SysTask.LockMode[GLASS_15];
					GPIO_ResetBits(LOCK_GPIO, LOCK_15_PIN);
					u8ClockCnt			= 0;
					u8ClockPer			= 0;
					SysTask.Lock_StateTime[GLASS_15] = SysTask.nTick + LOCK_SET_L_TIME;
					SysTask.Lock_State[GLASS_15] = LOCK_STATE_SENT;
				}
			}

			break;

		case LOCK_STATE_DEBOUNSE:
			if (SysTask.Lock_StateTime[GLASS_15] == 0)
			{
				if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_15_PIN) == 0) // //检测到零点 开锁
				{
					GPIO_SetBits(LOCK_GPIO, LOCK_15_PIN);
					SysTask.Lock_State[GLASS_15] = LOCK_STATE_DETECT;

					if (SysTask.SendState == SEND_IDLE)
						SysTask.SendState = SEND_TABLET_FINGER;

					g_FingerAck 		= ACK_SUCCESS;
					g_AckType			= ZERO_ACK_TYPE;
					g_GlassSendAddr 	= GLASS_15;
				}
			}

			break;

		case LOCK_STATE_SENT: //
			if (SysTask.Lock_StateTime[GLASS_15] != 0)
				break;

			if (u8ClockCnt < 4)
			{
				u8ClockCnt++;

				if (u8ClockPer == 0)
				{
					u8ClockPer			= 1;
					GPIO_SetBits(LOCK_GPIO, LOCK_15_PIN);
					SysTask.Lock_StateTime[GLASS_15] = SysTask.nTick + LOCK_SET_H_TIME;
				}
				else 
				{
					u8ClockPer			= 0;
					GPIO_ResetBits(LOCK_GPIO, LOCK_15_PIN);
					SysTask.Lock_StateTime[GLASS_15] = SysTask.nTick + LOCK_SET_L_TIME;
				}
			}
			else 
			{
				SysTask.Lock_State[GLASS_15] = LOCK_STATE_OFF;
				GPIO_SetBits(LOCK_GPIO, LOCK_15_PIN);
				SysTask.Lock_StateTime[GLASS_15] = SysTask.nTick + LOCK_SET_OFF_TIME; //停止电平

			}

			break;

		case LOCK_STATE_OFF: //
			if (SysTask.Lock_StateTime[GLASS_15] != 0)
				break;

			GPIO_ResetBits(LOCK_GPIO, LOCK_15_PIN);
			SysTask.Lock_StateTime[GLASS_15] = SysTask.nTick + LOCK_SET_L_TIME;
			SysTask.Lock_State[GLASS_15] = LOCK_STATE_DETECT;

