sforganization/NoMaster/STM32F103_1025_Yingshi/HARDWARE/COMMENT/SysComment.c
			//	点击了转动，这里让他转动起来
			SysTask.Moto_State[GLASS_15] = MOTO_STATE_INIT; //重新开始转动
			break;

		default:
			break;
	}
}


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void Lock_16_Task(void)
{
	static u8 u8ClockCnt = 0;
	static u8 u8ClockPer = 0;
	switch (SysTask.Lock_State[GLASS_16]) //_16锁
	{
		case LOCK_STATE_DETECT:
			if (SysTask.LockMode[GLASS_16] != SysTask.LockModeSave[GLASS_16])
			{
				if (SysTask.LockMode[GLASS_16] == LOCK_ON)
				{
					if (SysTask.Moto_WaitTime[GLASS_16] != 0) //如果电机在停止状态
					{
						SysTask.Moto_WaitTime[GLASS_16] = 0;
					}

					if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_16_PIN) == 0) // //检测到零点 开锁
					{
						SysTask.Lock_StateTime[GLASS_16] = MOTO_DEBOUNCE; //延时40ms到达中点
						SysTask.Moto_WaitTime[GLASS_16] = MOTO_DEBOUNCE;
						SysTask.Lock_State[GLASS_16] = LOCK_STATE_DEBOUNSE;
						SysTask.Moto_State[GLASS_16] = MOTO_STATE_STOP; //停止转动
						SysTask.LockModeSave[GLASS_16] = SysTask.LockMode[GLASS_16];
						SysTask.Lock_OffTime[GLASS_16] = LOCK_OFFTIME;
					}
				}
				else 
				{
					SysTask.LockModeSave[GLASS_16] = SysTask.LockMode[GLASS_16];
					GPIO_ResetBits(LOCK_GPIO, LOCK_16_PIN);
					u8ClockCnt			= 0;
					u8ClockPer			= 0;
					SysTask.Lock_StateTime[GLASS_16] = SysTask.nTick + LOCK_SET_L_TIME;
					SysTask.Lock_State[GLASS_16] = LOCK_STATE_SENT;
				}
			}

			break;

		case LOCK_STATE_DEBOUNSE:
			if (SysTask.Lock_StateTime[GLASS_16] == 0)
			{
				if (GPIO_ReadInputDataBit(LOCK_ZERO_GPIO, LOCK_ZERO_16_PIN) == 0) // //检测到零点 开锁
				{
					GPIO_SetBits(LOCK_GPIO, LOCK_16_PIN);
					SysTask.Lock_State[GLASS_16] = LOCK_STATE_DETECT;

					if (SysTask.SendState == SEND_IDLE)
						SysTask.SendState = SEND_TABLET_FINGER;

					g_FingerAck 		= ACK_SUCCESS;
					g_AckType			= ZERO_ACK_TYPE;
					g_GlassSendAddr 	= GLASS_16;
				}
			}

			break;

		case LOCK_STATE_SENT: //
			if (SysTask.Lock_StateTime[GLASS_16] != 0)
				break;

			if (u8ClockCnt < 4)
			{
				u8ClockCnt++;

				if (u8ClockPer == 0)
				{
					u8ClockPer			= 1;
					GPIO_SetBits(LOCK_GPIO, LOCK_16_PIN);
					SysTask.Lock_StateTime[GLASS_16] = SysTask.nTick + LOCK_SET_H_TIME;
				}
				else 
				{
					u8ClockPer			= 0;
					GPIO_ResetBits(LOCK_GPIO, LOCK_16_PIN);
					SysTask.Lock_StateTime[GLASS_16] = SysTask.nTick + LOCK_SET_L_TIME;
				}
			}
			else 
			{
				SysTask.Lock_State[GLASS_16] = LOCK_STATE_OFF;
				GPIO_SetBits(LOCK_GPIO, LOCK_16_PIN);
				SysTask.Lock_StateTime[GLASS_16] = SysTask.nTick + LOCK_SET_OFF_TIME; //停止电平

			}

			break;

		case LOCK_STATE_OFF: //
			if (SysTask.Lock_StateTime[GLASS_16] != 0)
				break;

			GPIO_ResetBits(LOCK_GPIO, LOCK_16_PIN);
			SysTask.Lock_StateTime[GLASS_16] = SysTask.nTick + LOCK_SET_L_TIME;
			SysTask.Lock_State[GLASS_16] = LOCK_STATE_DETECT;

			//	点击了转动，这里让他转动起来
			SysTask.Moto_State[GLASS_16] = MOTO_STATE_INIT; //重新开始转动
			break;

		default:
			break;
	}
}


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void SysSaveDataTask(void)
{
	static u8 u8Status	= 0;
	static u8 u8count	= 0;
	u8 i;

	if (SysTask.bEnSaveData == FALSE)
		return;

	switch (u8Status)
	{
		case SAVE_INIT:
			memset(SysTask.FlashData.u8FlashData, 0, sizeof(SysTask.FlashData.u8FlashData)); //清0

			//			  memcpy(SysTask.FlashData.u8FlashData, SysTask.WatchState, sizeof(SysTask.WatchState));
			for (i = 0; i < GLASS_MAX_CNT; i++)
			{
				SysTask.FlashData.Data.WatchState[i].MotoTime = SysTask.WatchState[i].MotoTime;
				SysTask.FlashData.Data.WatchState[i].u8Dir = SysTask.WatchState[i].u8Dir;
				SysTask.FlashData.Data.WatchState[i].u8LockState = SysTask.WatchState[i].u8LockState;
			}

			SysTask.FlashData.Data.u16LedMode = LED_MODE_ON; //LED模式
			u8Status = SAVE_WRITE;
			break;

		case SAVE_WRITE:
			if (FLASH_WriteMoreData(g_au32DataSaveAddr[SysTask.u16AddrOffset], SysTask.FlashData.u16FlashData, DATA_READ_CNT + LED_MODE_CNT + PASSWD_CNT))
			{
				u8count++;
				u8Status			= SAVE_WAIT;
				SysTask.u16SaveWaitTick = 100;		// 100ms 延时再重新写入
			}
			else 
			{
				u8Status			= SAVE_EXIT;
			}

			break;

		case SAVE_WAIT:
			if (SysTask.u16SaveWaitTick == 0)
			{
				u8Status			= SAVE_WRITE;

				if (u8count++ >= 7) //每页尝试8次
				{
					if (++SysTask.u16AddrOffset < ADDR_MAX_OFFSET) //共5页
					{
						for (i = 0; i < 3; i++) //重写8次最多
						{
							if (!FLASH_WriteMoreData(g_au32DataSaveAddr[0], &SysTask.u16AddrOffset, 1))
								break;

							delay_ms(20);
						}
					}
					else 
					{
						u8Status			= SAVE_EXIT;
					}
				}
			}

			break;

		case SAVE_EXIT:
			SysTask.bEnSaveData = FALSE;
			u8Status = SAVE_INIT;
			u8count = 0;
			break;

		default:
			u8Status = SAVE_EXIT;
			break;
	}
}


/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void MainTask(void)
{
	SysSaveDataTask();
	LedTask();
	SendTabletTask();								//发送给平板任务
	TabletToHostTask(); 							//接收平板命令任务处理
	HostToTabletTask(); 							//主机发送给从机的命令任务处理
	FingerTouchTask();								//指纹模块
	Moto_01_Task();
	Moto_02_Task();
	Moto_03_Task();
	Moto_04_Task();
	Moto_05_Task();
	Moto_06_Task();
	Moto_07_Task();
	Moto_08_Task();
	Moto_09_Task();
	Moto_11_Task();
	Moto_12_Task();
	Moto_13_Task();
	Moto_14_Task();
	Moto_15_Task();
	Moto_16_Task();


	Lock_01_Task();
	Lock_02_Task();
	Lock_03_Task();
	Lock_04_Task();
	Lock_05_Task();
	Lock_06_Task();
	Lock_07_Task();
	Lock_08_Task();
	Lock_09_Task();
	Lock_10_Task();
	Lock_11_Task();
	Lock_12_Task();
	Lock_13_Task();
	Lock_14_Task();
	Lock_15_Task();
	Lock_16_Task();
}



/*******************************************************************************
* 名称: 
* 功能: 
* 形参:		
* 返回: 无
* 说明: 
*******************************************************************************/
void SysInit(void)
{
	u8 i, j;

	SysTask.u16AddrOffset = FLASH_ReadHalfWord(g_au32DataSaveAddr[0]); //读取
	memset(SysTask.FlashData.u8FlashData, 0, sizeof(SysTask.FlashData.u8FlashData));

	if ((SysTask.u16AddrOffset == 0xffff) || (SysTask.u16AddrOffset >= ADDR_MAX_OFFSET) ||
		 (SysTask.u16AddrOffset == 0)) //初始状态 flash是0xffff
	{
		SysTask.u16AddrOffset = 1;					//从第一页开始写入

		for (i = 0; i < 8; i++) //重写8次最多
		{
			if (!FLASH_WriteMoreData(g_au32DataSaveAddr[0], &SysTask.u16AddrOffset, 1))
				break;

			delay_ms(20);
		}


